using InspecWeb.Models;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using System;
using System.Collections.Generic;
using System.Text;

namespace InspecWeb.Data.Seeders
{
    public class CabineSeeder : IEntityTypeConfiguration<Cabine>
    {

        public void Configure(EntityTypeBuilder<Cabine> builder)
        {
            builder.HasData(
                new Cabine
                {
                    Id = 1,
                    Prefix = "พลเอก",
                    Name = "ประวิตร  วงษ์สุวรรณ",
                    Position = "รองนายกรัฐมนตรี",
                    Image = "pravit.jpg",
                    Detail = "กำกับและติดตามการปฏิบัติราชการในพื้นที่ ดังนี้ เขตตรวจราชการที่ 1(จังหวัดชัยนาท พระนครศรีอยุธยา ลพบุรี สระบุรี สิงห์บุรี อ่างทอง) เขตตรวจราชการที่ 7(จังหวัดนราธิวาส  ปัตตานี  ยะลา) เขตตรวจราชการที่ 13(จังหวัดชัยภูมิ  นครราชสีมา  บุรีรัมย์ สุรินทร์) เขตตรวจราชการที่ 16(จังหวัดเชียงราย น่าน พะเยา แพร่)"
                },
                new Cabine
                {
                    Id = 2,
                    Prefix = "นาย",
                    Name = "สมคิด  จาตุศรีพิทักษ์",
                    Position = "รองนายกรัฐมนตรี",
                    Image = "somkid.jpg",
                    Detail = "กำกับและติดตามการปฏิบัติราชการในพื้นที่ ดังนี้ เขตตรวจราชการที่  2  (จังหวัดนนทบุรี  ปทุมธานี  นครปฐม  สมุทรปราการ) เขตตรวจราชการที่  8(จังหวัดฉะเชิงเทรา ชลบุรี  ระยอง) เขตตรวจราชการที่  12(จังหวัดกาฬสินธุ์  ขอนแก่น มหาสารคาม ร้อยเอ็ด) เขตตรวจราชการที่  17(จังหวัดตาก พิษณุโลก เพชรบูรณ์  สุโขทัย อุตรดิตถ์)"
                },
                new Cabine
                {
                    Id = 3,
                    Prefix = "นาย",
                    Name = "วิษณุ  เครืองาม",
                    Position = "รองนายกรัฐมนตรี",
                    Image = "visanu.jpg",
                    Detail = "กำกับและติดตามการปฏิบัติราชการในพื้นที่ ดังนี้ เขตตรวจราชการที่  4(จังหวัดประจวบคีรีขันธ์ เพชรบุรี  สมุทรสงคราม  สมุทรสาคร) เขตตรวจราชการที่  5(จังหวัดชุมพร นครศรีธรรมราช พััทลุง สุราษฎร์ธานี สงขลา) เขตตรวจราชการที่ 10(จังหวัดบึงกาฬ  เลย  หนองคาย  หนองบัวลำภู  อุดรธานี) เขตตรวจราชการที่ 18(จังหวัดกำเเพงเพชร  นครสววรค์  พิจิตร  อุทัยธานี)"
                },
                new Cabine
                {
                    Id = 4,
                    Prefix = "นาย",
                    Name = "จุรินทร์  ลักษณวิศิษฏ์",
                    Position = "รองนายกรัฐมนตรี",
                    Image = "jurin.jpg",
                    Detail = "กำกับและติดตามการปฏิบัติราชการในพื้นที่ ดังนี้ เขตตรวจราชการที่ 6 (จังหวัดกระบี่  ตรัง  พังงา  ภูเก็ต ระนอง สตูล) เขตตรวจราชการที่ 9(จังหวัดจัทบุรี  ตราด  นครนายก  ปราจีนบุรี  สระแก้ว) เขตตรวจราชการที่ 14(จังหวัดยโสธร  ศรีสะเกษ  อำนาจเจริญ  อุบลราชธานี)"
                },
                new Cabine
                {
                    Id = 5,
                    Prefix = "นาย",
                    Name = "อนุทิน  ชาญวีรกูล",
                    Position = "รองนายกรัฐมนตรี",
                    Image = "anutin.jpg",
                    Detail = "กำกับและติดตามการปฏิบัติราชการในพื้นที่ ดังนี้ เขตตรวจราชการที่ 3(จังหวัดกาญจนบุรี  ราชบุรี  สุพรรณบุรี) เขตตรวจราชการที่ 11(จังหวัดนครพนม  มุกดาหาร  สกลนคร) เขตตรวจราชการที่ 15(จังหวัดเชียงใหม่  แม่ฮ่องสอน  ลำปาง  ลำพูน)"
                }

            );
        }
    }
}