using InspecWeb.Models;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using System;
using System.Collections.Generic;
using System.Text;

namespace InspecWeb.Data.Seeders
{
    public class InstructionOrderSeeder : IEntityTypeConfiguration<InstructionOrder>
    {

        public void Configure(EntityTypeBuilder<InstructionOrder> builder)
        {
            builder.HasData(
                   new InstructionOrder
                   { 
                       Id = 1, 
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2562",
                       Order= "คำสั่ง นร ที่ 313/2562 ลงวันที่ 28 ตุลาคม 2562",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)",
                       File ="",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 2,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2562",
                       Order = "คำสั่ง นร. ที่ 102/2562 ลงวันที่ 10 พฤษภาคม 2562",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)",
                       File = "",
                     
                   },
                   new InstructionOrder
                   {
                       Id = 3,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2562",
                       Order = "คำสั่ง นร. ที่ 5/2562 ลงวันที่ 7 มกราคม 2562",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)",
                       File = "",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 4,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2561",
                       Order = "คำสั่ง สปน. ที่ 262/2561 ลงวันที่ 16 ตุลาคม 2561",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)",
                       File = "",
                       
                   },
                   new InstructionOrder
                   {
                       Id = 5,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2561",
                       Order = "คำสั่ง นร. ที่ 255/2561 ลงวันที่ 5 ตุลาคม 2561",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขตส่วนกลาง,2,3),นายณรงค์ เชื้อบุญช่วย(เขต1,4,7),นางสาวปภัสมน อัมราลิขิต(เขต5,6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นายกรีฑา สพโชค(เขต13,14),นางดวงตา ตันโช(เขต15,16),นายพีระ ทองโพธิ์(เขต15,16,17,18)",
                       File = "",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 6,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2561",
                       Order = "คำสั่ง นร. ที่ 206/2561 ลงวันที่ 24 สิงหาคม 2561",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขตส่วนกลาง,2,3),นายณรงค์ เชื้อบุญช่วย(เขต1,4,7),นางสาวปภัสมน อัมราลิขิต(เขต5,6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นายกรีฑา สพโชค(เขต13,14), นายพีระ ทองโพธิ์(เขต15,16,17,18)",
                       File = "",
                     
                   },
                   new InstructionOrder
                   {
                       Id = 7,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2561",
                       Order = "คำสั่ง นร. ที่ 100/2561 ลงวันที่ 27 เมษายน 2561",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,5),นายนริสชัย ป้อมเสือ(เขต2),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายณรงค์ เชื้อบุญช่วย(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)",
                       File = "",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 8,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2561",
                       Order = "คำสั่ง นร. ที่ 76/2561 ลงวันที่ 2 เมษายน 2561",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,5),นายนริสชัย ป้อมเสือ(เขต2),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)",
                       File = "",
                       
                   },
                   new InstructionOrder
                   {
                       Id = 9,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2561",
                       Order = "คำสั่ง นร. ที่ 76/2561 ลงวันที่ 2 เมษายน 2561",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2,5),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)",
                       File = "",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 10,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2560",
                       Order = " คำสั่ง นร. ที่ 336/2560 ลงวันที่ 13 ธันวาคม 2560",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),นางสาวปภัสมน อัมราลิขิต(เขต1,6,7),นายสุรศักดิ์ เรียงเครือ(เขต2,15,16),นายโชคชัย เดชอมรธัญ(เขต4),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต5, 17, 18),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10, 11, 13),นายศักดิ์ สมบุญโต(เขต12)",
                       File = "",
                     
                   },
                   new InstructionOrder
                   {
                       Id = 11,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2560",
                       Order = " คำสั่ง นร. ที่ 306/2560 ลงวันที่ 20 พฤศจิกายน 2560",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2,5),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6, 7, 18),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10, 11, 13),นายศักดิ์ สมบุญโต(เขต12),นายสุรศักดิ์ เรียงเครือ(เขต15, 16, 17)",
                       File = "",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 12,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2560",
                       Order = " คำสั่ง นร. ที่ 215/2560 ลงวันที่ 6 กันยายน 2560",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางสาวปภัสมน อัมราลิขิต(เขต6),นางประภาศรี บุญวิเศษ(เขต7,15),พ.ต.ท.พงศ์พร พรามณ์เสน่ห์(เขต8),นายอิสระ ศิริวรภา(เขต10),นางอัจจิมา จันทร์สุวานิชย์(เขต11,14),นางภัทรภร ฐิติยาภรณ์(เขต12,17),นางสาวอรนุช ศรีนนท์(เขต13),นายสุรศักดิ์ เรียงเครือ(เขต16)",
                       File = "",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 13,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2560",
                       Order = " คำสั่ง นร. ที่ 100/2560 ลงวันที่ 28 มีนาคม 2560",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางสาวปภัสมน อัมราลิขิต(เขต6),นางประภาศรี บุญวิเศษ(เขต7,15),นายสุรศักดิ์ เรียงเครือ(เขต8,16),นายอิสระ ศิริวรภา(เขต10),นางอัจจิมา จันทร์สุวานิชย์(เขต11,14),นางภัทรภร ฐิติยาภรณ์(เขต12,17),นางสาวอรนุช ศรีนนท์(เขต13)",
                       File = "",
                      
                   },
                   new InstructionOrder
                   {
                       Id = 14,
                       Name = "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ",
                       Year = "2560",
                       Order = " คำสั่ง นร.ที่ 3 / 2560 ลงวันที่ 5 มกราคม 2560",
                       CreateBy = "ผู้ตรวจราชการสำนักนายกรัฐมนตรี",
                       Detail = "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,6,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางประภาศรี บุญวิเศษ(เขต7, 15),นายสุรศักดิ์ เรียงเครือ(เขต8, 16),นายอิสระ ศิริวรภา(เขต10, 13),นางอัจจิมา จันทร์สุวานิชย์(เขต11, 14),นางภัทรภร ฐิติยาภรณ์(เขต12, 17)",
                       File = "",
                      
                   }



                   
            );
        }
    }
}