using Microsoft.EntityFrameworkCore.Migrations;

namespace InspecWeb.Data.Migrations
{
    public partial class UpdateInstructionorder : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 14L);

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 1L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { " สำนักนายกรัฐมนตรี", "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)", "Order313-2562.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 313/2562 ลงวันที่ 28 ตุลาคม 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 2L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายยงยุทธ สุทธิชื่น (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย(เขต1,12),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต2),นายณรงค์ เชื้อบุญช่วย(เขต3,4),นายธสรณ์อัฑฒ์ ธนิทธิพันธ์(เขต5,7),นางสาวปภัสมน อัมราลิขิต(เขต6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นางสุมิตรา อติศัพท์(เขต13,14),นางดวงตา ตันโช(เขต15,16),นายพีระ ทองโพธิ์(เขต17,18)", "OrderInspector102_2562_100562meta.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 102/2562 ลงวันที่ 10 พฤษภาคม 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 3L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขตส่วนกลาง,2),นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย(เขต1,12),นายณรงค์ เชื้อบุญช่วย(เขต3,4,7),นางสาวปภัสมน อัมราลิขิต(เขต5,6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นายกรีฑา สพโชค(เขต13,14), นางดวงตา ตันโช(เขต15,16), นายพีระ ทองโพธิ์(เขต17,18)", "order5-2562.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "สำนักนายกรัฐมนตรี ที่ 5/2562 ลงวันที่ 7 มกราคม 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 4L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขตส่วนกลาง,2,3),นายณรงค์ เชื้อบุญช่วย(เขต1,4,7),นางสาวปภัสมน อัมราลิขิต(เขต5,6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นายกรีฑา สพโชค(เขต13,14),นางดวงตา ตันโช(เขต15,16),นายพีระ ทองโพธิ์(เขต15,16,17,18)", "Order262-2561.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 262/2561 ลงวันที่ 16 ตุลาคม 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 5L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขตส่วนกลาง,2,3),นายณรงค์ เชื้อบุญช่วย(เขต1,4,7),นางสาวปภัสมน อัมราลิขิต(เขต5,6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นายกรีฑา สพโชค(เขต13,14), นายพีระ ทองโพธิ์(เขต15,16,17,18)", "OrderInspector255_2561_051061metanew.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 255/2561 ลงวันที่ 5 ตุลาคม 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 6L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,5),นายนริสชัย ป้อมเสือ(เขต2),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายณรงค์ เชื้อบุญช่วย(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)", "Order206-2561.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 206/2561 ลงวันที่ 24 สิงหาคม 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 7L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,5),นายนริสชัย ป้อมเสือ(เขต2),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)", "Order100-2561.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 100/2561 ลงวันที่ 27 เมษายน 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 8L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2,5),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)", "OrderInspector76_2561_020461meta.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 76/2561 ลงวันที่ 2 เมษายน 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 9L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),นางสาวปภัสมน อัมราลิขิต(เขต1,6,7),นายสุรศักดิ์ เรียงเครือ(เขต2,15,16),นายโชคชัย เดชอมรธัญ(เขต4),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต5,17,18),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11,13),นายศักดิ์ สมบุญโต(เขต12)", "Order336-2560.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สำนักนายกรัฐมนตรี ที่ 336/2560 ลงวันที่ 13 ธันวาคม 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 10L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2,5),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7,18),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11,13),นายศักดิ์ สมบุญโต(เขต12),นายสุรศักดิ์ เรียงเครือ(เขต15,16,17)", "Order306-2560.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง สำนักนายกรัฐมนตรี ที่ 306/2560 ลงวันที่ 20 พฤศจิกายน 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 11L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางสาวปภัสมน อัมราลิขิต(เขต6),นางประภาศรี บุญวิเศษ(เขต7,15),พ.ต.ท.พงศ์พร พรามณ์เสน่ห์(เขต8),นายอิสระ ศิริวรภา(เขต10),นางอัจจิมา จันทร์สุวานิชย์(เขต11,14),นางภัทรภร ฐิติยาภรณ์(เขต12,17),นางสาวอรนุช ศรีนนท์(เขต13),นายสุรศักดิ์ เรียงเครือ(เขต16)", "Order215-2560.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง สำนักนายกรัฐมนตรี ที่ 215/2560 ลงวันที่ 6 กันยายน 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 12L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางสาวปภัสมน อัมราลิขิต(เขต6),นางประภาศรี บุญวิเศษ(เขต7,15),นายสุรศักดิ์ เรียงเครือ(เขต8,16),นายอิสระ ศิริวรภา(เขต10),นางอัจจิมา จันทร์สุวานิชย์(เขต11,14),นางภัทรภร ฐิติยาภรณ์(เขต12,17),นางสาวอรนุช ศรีนนท์(เขต13)", "Order100-2560.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง สำนักนายกรัฐมนตรี ที่ 100/2560 ลงวันที่ 28 มีนาคม 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 13L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "สำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,6,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางประภาศรี บุญวิเศษ(เขต7,15),นายสุรศักดิ์ เรียงเครือ(เขต8,16),นายอิสระ ศิริวรภา(เขต10,13),นางอัจจิมา จันทร์สุวานิชย์(เขต11,14),นางภัทรภร ฐิติยาภรณ์(เขต12,17)", "Order3-2560.pdf", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง สำนักนายกรัฐมนตรี ที่ 3/2560 ลงวันที่ 5 มกราคม 2560" });
        }



        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 1L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã ·Õè 313/2562 Å§ÇÑ¹·Õè 28 µØÅÒ¤Á 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 2L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 102/2562 Å§ÇÑ¹·Õè 10 ¾ÄÉÀÒ¤Á 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 3L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 5/2562 Å§ÇÑ¹·Õè 7 Á¡ÃÒ¤Á 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 4L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ Ê»¹. ·Õè 262/2561 Å§ÇÑ¹·Õè 16 µØÅÒ¤Á 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 5L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µÊèÇ¹¡ÅÒ§,2,3),¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ(à¢µ1,4,7),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ5,6),¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µ8,9),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13,14),¹Ò§´Ç§µÒ µÑ¹âª(à¢µ15,16),¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì(à¢µ15,16,17,18)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 255/2561 Å§ÇÑ¹·Õè 5 µØÅÒ¤Á 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 6L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µÊèÇ¹¡ÅÒ§,2,3),¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ(à¢µ1,4,7),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ5,6),¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µ8,9),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13,14), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì(à¢µ15,16,17,18)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 206/2561 Å§ÇÑ¹·Õè 24 ÊÔ§ËÒ¤Á 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 7L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,5),¹ÒÂ¹ÃÔÊªÑÂ »éÍÁàÊ×Í(à¢µ2),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6,7),¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12), ¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13), ¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15,16,17,18)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 100/2561 Å§ÇÑ¹·Õè 27 àÁÉÒÂ¹ 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 8L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,5),¹ÒÂ¹ÃÔÊªÑÂ »éÍÁàÊ×Í(à¢µ2),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6,7),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12), ¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13), ¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15,16,17,18)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 76/2561 Å§ÇÑ¹·Õè 2 àÁÉÒÂ¹ 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 9L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2,5),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6,7),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12), ¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13), ¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15,16,17,18)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 76/2561 Å§ÇÑ¹·Õè 2 àÁÉÒÂ¹ 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 10L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ1,6,7),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ2,15,16),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ5, 17, 18),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10, 11, 13),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 336/2560 Å§ÇÑ¹·Õè 13 ¸Ñ¹ÇÒ¤Á 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 11L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2,5),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6, 7, 18),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10, 11, 13),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15, 16, 17)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 306/2560 Å§ÇÑ¹·Õè 20 ¾ÄÈ¨Ô¡ÒÂ¹ 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 12L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,18),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2),¹ÒÂä¾âÃ¨¹ì ÍÒ¨ÃÑ¡ÉÒ(à¢µ3,4),¹ÒÂÇÃ¾Ñ¹¸ì àÂç¹·ÃÑ¾Âì(à¢µ5,9),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6),¹Ò§»ÃÐÀÒÈÃÕ ºØ­ÇÔàÈÉ(à¢µ7,15),¾.µ.·.¾§Èì¾Ã ¾ÃÒÁ³ìàÊ¹èËì(à¢µ8),¹ÒÂÍÔÊÃÐ ÈÔÃÔÇÃÀÒ(à¢µ10),¹Ò§ÍÑ¨¨ÔÁÒ ¨Ñ¹·ÃìÊØÇÒ¹ÔªÂì(à¢µ11,14),¹Ò§ÀÑ·ÃÀÃ °ÔµÔÂÒÀÃ³ì(à¢µ12,17),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ13),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ16)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 215/2560 Å§ÇÑ¹·Õè 6 ¡Ñ¹ÂÒÂ¹ 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 13L,
                columns: new[] { "CreateBy", "Detail", "File", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,18),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2),¹ÒÂä¾âÃ¨¹ì ÍÒ¨ÃÑ¡ÉÒ(à¢µ3,4),¹ÒÂÇÃ¾Ñ¹¸ì àÂç¹·ÃÑ¾Âì(à¢µ5,9),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6),¹Ò§»ÃÐÀÒÈÃÕ ºØ­ÇÔàÈÉ(à¢µ7,15),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ8,16),¹ÒÂÍÔÊÃÐ ÈÔÃÔÇÃÀÒ(à¢µ10),¹Ò§ÍÑ¨¨ÔÁÒ ¨Ñ¹·ÃìÊØÇÒ¹ÔªÂì(à¢µ11,14),¹Ò§ÀÑ·ÃÀÃ °ÔµÔÂÒÀÃ³ì(à¢µ12,17),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ13)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 100/2560 Å§ÇÑ¹·Õè 28 ÁÕ¹Ò¤Á 2560" });

            migrationBuilder.InsertData(
                table: "InstructionOrders",
                columns: new[] { "Id", "CreateBy", "CreatedAt", "Detail", "File", "Name", "Order", "Year" },
                values: new object[] { 14L, "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", null, "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,6,18),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2),¹ÒÂä¾âÃ¨¹ì ÍÒ¨ÃÑ¡ÉÒ(à¢µ3,4),¹ÒÂÇÃ¾Ñ¹¸ì àÂç¹·ÃÑ¾Âì(à¢µ5,9),¹Ò§»ÃÐÀÒÈÃÕ ºØ­ÇÔàÈÉ(à¢µ7, 15),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ8, 16),¹ÒÂÍÔÊÃÐ ÈÔÃÔÇÃÀÒ(à¢µ10, 13),¹Ò§ÍÑ¨¨ÔÁÒ ¨Ñ¹·ÃìÊØÇÒ¹ÔªÂì(à¢µ11, 14),¹Ò§ÀÑ·ÃÀÃ °ÔµÔÂÒÀÃ³ì(à¢µ12, 17)", "", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã.·Õè 3 / 2560 Å§ÇÑ¹·Õè 5 Á¡ÃÒ¤Á 2560", "2560" });


        }
    }
}
