using System;
using Microsoft.EntityFrameworkCore.Migrations;

namespace InspecWeb.Data.Migrations
{
    public partial class EditDistrictSeederFiscalYearSchema : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.AddColumn<DateTime>(
                name: "EndDate",
                table: "FiscalYear",
                nullable: false,
                defaultValue: new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified));

            migrationBuilder.AddColumn<DateTime>(
                name: "StartDate",
                table: "FiscalYear",
                nullable: false,
                defaultValue: new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified));

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 1L,
                column: "Name",
                value: "พระนคร");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 2L,
                column: "Name",
                value: "ดุสิต");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 3L,
                column: "Name",
                value: "หนองจอก");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 4L,
                column: "Name",
                value: "บางรัก");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 5L,
                column: "Name",
                value: "บางเขน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 6L,
                column: "Name",
                value: "บางกะปิ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 7L,
                column: "Name",
                value: "ปทุมวัน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 8L,
                column: "Name",
                value: "ป้อมปราบศัตรูพ่าย");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 9L,
                column: "Name",
                value: "พระโขนง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 10L,
                column: "Name",
                value: "มีนบุรี");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 11L,
                column: "Name",
                value: "ลาดกระบัง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 12L,
                column: "Name",
                value: "ยานนาวา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 13L,
                column: "Name",
                value: "สัมพันธวงศ์");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 14L,
                column: "Name",
                value: "พญาไท");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 15L,
                column: "Name",
                value: "ธนบุรี");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 16L,
                column: "Name",
                value: "บางกอกใหญ่");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 17L,
                column: "Name",
                value: "ห้วยขวาง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 18L,
                column: "Name",
                value: "คลองสาน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 19L,
                column: "Name",
                value: "ตลิ่งชัน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 20L,
                column: "Name",
                value: "บางกอกน้อย");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 21L,
                column: "Name",
                value: "บางขุนเทียน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 22L,
                column: "Name",
                value: "ภาษีเจริญ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 23L,
                column: "Name",
                value: "หนองแขม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 24L,
                column: "Name",
                value: "ราษฎร์บูรณะ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 25L,
                column: "Name",
                value: "บางพลัด");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 26L,
                column: "Name",
                value: "ดินแดง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 27L,
                column: "Name",
                value: "บึงกุ่ม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 28L,
                column: "Name",
                value: "สาทร");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 29L,
                column: "Name",
                value: "บางซื่อ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 30L,
                column: "Name",
                value: "จตุจักร");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 31L,
                column: "Name",
                value: "บางคอแหลม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 32L,
                column: "Name",
                value: "ประเวศ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 33L,
                column: "Name",
                value: "คลองเตย");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 34L,
                column: "Name",
                value: "สวนหลวง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 35L,
                column: "Name",
                value: "จอมทอง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 36L,
                column: "Name",
                value: "ดอนเมือง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 37L,
                column: "Name",
                value: "ราชเทวี");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 38L,
                column: "Name",
                value: "ลาดพร้าว");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 39L,
                column: "Name",
                value: "วัฒนา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 40L,
                column: "Name",
                value: "บางแค");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 41L,
                column: "Name",
                value: "หลักสี่");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 42L,
                column: "Name",
                value: "สายไหม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 43L,
                column: "Name",
                value: "คันนายาว");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 44L,
                column: "Name",
                value: "สะพานสูง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 45L,
                column: "Name",
                value: "วังทองหลาง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 46L,
                column: "Name",
                value: "คลองสามวา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 47L,
                column: "Name",
                value: "บางนา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 48L,
                column: "Name",
                value: "ทวีวัฒนา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 49L,
                column: "Name",
                value: "ทุ่งครุ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 50L,
                column: "Name",
                value: "บางบอน");

            migrationBuilder.InsertData(
                table: "Districts",
                columns: new[] { "Id", "Name", "ProvinceId" },
                values: new object[,]
                {
                    { 924L, "สิรินธร", 77L },
                    { 644L, "งาว", 53L },
                    { 645L, "แจ้ห่ม", 53L },
                    { 646L, "เถิน", 53L },
                    { 647L, "เมืองปาน", 53L },
                    { 648L, "เมืองลำปาง", 53L },
                    { 649L, "แม่ทะ", 53L },
                    { 650L, "แม่พริก", 53L },
                    { 651L, "แม่เมาะ", 53L },
                    { 652L, "วังเหนือ", 53L },
                    { 653L, "สบปราบ", 53L },
                    { 654L, "เสริมงาม", 53L },
                    { 655L, "ห้างฉัตร", 53L },
                    { 656L, "ทุ่งหัวช้าง", 54L },
                    { 657L, "บ้านธิ", 54L },
                    { 658L, "บ้านโฮ่ง", 54L },
                    { 659L, "ป่าซาง", 54L },
                    { 660L, "เมืองลำพูน", 54L },
                    { 661L, "แม่ทา", 54L },
                    { 662L, "ลี้", 54L },
                    { 663L, "เวียงหนองล่อง", 54L },
                    { 664L, "เชียงคาน", 55L },
                    { 643L, "เกาะคา", 53L },
                    { 642L, "หนองม่วง", 52L },
                    { 641L, "สระโบสถ์", 52L },
                    { 640L, "ลำสนธิ", 52L },
                    { 618L, "บ้านฉาง", 50L },
                    { 619L, "ปลวกแดง", 50L },
                    { 620L, "เมืองระยอง", 50L },
                    { 621L, "วังจันทร์", 50L },
                    { 622L, "จอมบึง", 51L },
                    { 623L, "ดำเนินสะดวก", 51L },
                    { 624L, "บางแพ", 51L },
                    { 625L, "บ้านคา", 51L },
                    { 626L, "บ้านโป่ง", 51L },
                    { 627L, "ปากท่อ", 51L },
                    { 665L, "ด่านซ้าย", 55L },
                    { 628L, "โพธาราม", 51L },
                    { 630L, "วัดเพลง", 51L },
                    { 631L, "สวนผึ้ง", 51L },
                    { 632L, "โคกเจริญ", 52L },
                    { 633L, "โคกสำโรง", 52L },
                    { 634L, "ชัยบาดาล", 52L },
                    { 635L, "ท่าวุ้ง", 52L },
                    { 636L, "ท่าหลวง", 52L },
                    { 637L, "บ้านหมี่", 52L },
                    { 638L, "พัฒนานิคม", 52L },
                    { 639L, "เมืองลพบุรี", 52L },
                    { 629L, "เมืองราชบุรี", 51L },
                    { 666L, "ท่าลี่", 55L },
                    { 667L, "นาด้วง", 55L },
                    { 668L, "นาแห้ว", 55L },
                    { 695L, "วังหิน", 56L },
                    { 696L, "ศรีรัตนะ", 56L },
                    { 697L, "ศิลาลาด", 56L },
                    { 698L, "ห้วยทับทัน", 56L },
                    { 699L, "อุทุมพรพิสัย", 56L },
                    { 700L, "กุดบาก", 57L },
                    { 701L, "กุสุมาลย์", 57L },
                    { 702L, "คำตากล้า", 57L },
                    { 703L, "โคกศรีสุพรรณ", 57L },
                    { 704L, "เจริญศิลป์", 57L },
                    { 694L, "ราษีไศล", 56L },
                    { 705L, "เต่างอย", 57L },
                    { 707L, "บ้านม่วง", 57L },
                    { 708L, "พรรณานิคม", 57L },
                    { 709L, "พังโคน", 57L },
                    { 710L, "โพนนาแก้ว", 57L },
                    { 711L, "ภูพาน", 57L },
                    { 712L, "เมืองสกลนคร", 57L },
                    { 713L, "วานรนิวาส", 57L },
                    { 714L, "วาริชภูมิ", 57L },
                    { 715L, "สว่างแดนดิน", 57L },
                    { 716L, "ส่องดาว", 57L },
                    { 706L, "นิคมน้ำอูน", 57L },
                    { 617L, "บ้านค่าย", 50L },
                    { 693L, "ยางชุมน้อย", 56L },
                    { 691L, "เมืองจันทร์", 56L },
                    { 669L, "ปากชม", 55L },
                    { 670L, "ผาขาว", 55L },
                    { 671L, "ภูกระดึง", 55L },
                    { 672L, "ภูเรือ", 55L },
                    { 673L, "ภูหลวง", 55L },
                    { 674L, "เมืองเลย", 55L },
                    { 675L, "วังสะพุง", 55L },
                    { 676L, "หนองหิน", 55L },
                    { 677L, "เอราวัณ", 55L },
                    { 678L, "กันทรลักษ์", 56L },
                    { 692L, "เมืองศรีสะเกษ", 56L },
                    { 679L, "กันทรารมย์", 56L },
                    { 681L, "ขุนหาญ", 56L },
                    { 682L, "น้ำเกลี้ยง", 56L },
                    { 683L, "โนนคูณ", 56L },
                    { 684L, "บึงบูรพ์", 56L },
                    { 685L, "เบญจลักษ์", 56L },
                    { 686L, "ปรางค์กู่", 56L },
                    { 687L, "พยุห์", 56L },
                    { 688L, "โพธิ์ศรีสุวรรณ", 56L },
                    { 689L, "ไพรบึง", 56L },
                    { 690L, "ภูสิงห์", 56L },
                    { 680L, "ขุขันธ์", 56L },
                    { 717L, "อากาศอำนวย", 57L },
                    { 616L, "นิคมพัฒนา", 50L },
                    { 614L, "แกลง", 50L },
                    { 541L, "หนองม่วงไข่", 41L },
                    { 542L, "กะทู้", 42L },
                    { 543L, "ถลาง", 42L },
                    { 544L, "เมืองภูเก็ต", 42L },
                    { 545L, "กันทรวิชัย", 43L },
                    { 546L, "กุดรัง", 43L },
                    { 547L, "แกดำ", 43L },
                    { 548L, "โกสุมพิสัย", 43L },
                    { 549L, "ชื่นชม", 43L },
                    { 550L, "เชียงยืน", 43L },
                    { 551L, "นาเชือก", 43L },
                    { 552L, "นาดูน", 43L },
                    { 553L, "บรบือ", 43L },
                    { 554L, "พยัคฆภูมิพิสัย", 43L },
                    { 555L, "เมืองมหาสารคาม", 43L },
                    { 556L, "ยางสีสุราช", 43L },
                    { 557L, "วาปีปทุม", 43L },
                    { 558L, "คำชะอี", 44L },
                    { 559L, "ดงหลวง", 44L },
                    { 560L, "ดอนตาล", 44L },
                    { 561L, "นิคมคำสร้อย", 44L },
                    { 540L, "สูงเม่น", 41L },
                    { 539L, "สอง", 41L },
                    { 538L, "วังชิ้น", 41L },
                    { 537L, "ลอง", 41L },
                    { 515L, "แก่งกระจาน", 39L },
                    { 516L, "เขาย้อย", 39L },
                    { 517L, "ชะอำ", 39L },
                    { 518L, "ท่ายาง", 39L },
                    { 519L, "บ้านลาด", 39L },
                    { 520L, "บ้านแหลม", 39L },
                    { 521L, "เมืองเพชรบุรี", 39L },
                    { 522L, "หนองหญ้าปล้อง", 39L },
                    { 523L, "เขาค้อ", 40L },
                    { 524L, "ชนแดน", 40L },
                    { 562L, "เมืองมุกดาหาร", 44L },
                    { 525L, "น้ำหนาว", 40L },
                    { 527L, "เมืองเพชรบูรณ์", 40L },
                    { 528L, "วังโป่ง", 40L },
                    { 529L, "วิเชียรบุรี", 40L },
                    { 530L, "ศรีเทพ", 40L },
                    { 531L, "หนองไผ่", 40L },
                    { 532L, "หล่มเก่า", 40L },
                    { 533L, "หล่มสัก", 40L },
                    { 534L, "เด่นชัย", 41L },
                    { 535L, "เมืองแพร่", 41L },
                    { 536L, "ร้องกวาง", 41L },
                    { 526L, "บึงสามพัน", 40L },
                    { 563L, "หนองสูง", 44L },
                    { 564L, "หว้านใหญ่", 44L },
                    { 565L, "ขุนยวม", 45L },
                    { 592L, "เชียงขวัญ", 48L },
                    { 593L, "ทุ่งเขาหลวง", 48L },
                    { 594L, "ธวัชบุรี", 48L },
                    { 595L, "ปทุมรัตต์", 48L },
                    { 596L, "พนมไพร", 48L },
                    { 597L, "โพธิ์ชัย", 48L },
                    { 598L, "โพนทราย", 48L },
                    { 599L, "โพนทอง", 48L },
                    { 600L, "เมยวดี", 48L },
                    { 601L, "เมืองร้อยเอ็ด", 48L },
                    { 591L, "จังหาร", 48L },
                    { 602L, "เมืองสรวง", 48L },
                    { 604L, "สุวรรณภูมิ", 48L },
                    { 605L, "เสลภูมิ", 48L },
                    { 606L, "หนองพอก", 48L },
                    { 607L, "หนองฮี", 48L },
                    { 608L, "อาจสามารถ", 48L },
                    { 609L, "กระบุรี", 49L },
                    { 610L, "กะเปอร์", 49L },
                    { 611L, "เมืองระนอง", 49L },
                    { 612L, "ละอุ่น", 49L },
                    { 613L, "สุขสำราญ", 49L },
                    { 603L, "ศรีสมเด็จ", 48L },
                    { 615L, "เขาชะเมา", 50L },
                    { 590L, "จตุรพักตรพิมาน", 48L },
                    { 588L, "รามัน", 47L },
                    { 566L, "ปางมะผ้า", 45L },
                    { 567L, "ปาย", 45L },
                    { 568L, "เมืองแม่ฮ่องสอน", 45L },
                    { 569L, "แม่ลาน้อย", 45L },
                    { 570L, "แม่สะเรียง", 45L },
                    { 571L, "สบเมย", 45L },
                    { 572L, "กุดชุม", 46L },
                    { 573L, "ค้อวัง", 46L },
                    { 574L, "คำเขื่อนแก้ว", 46L },
                    { 575L, "ทรายมูล", 46L },
                    { 589L, "เกษตรวิสัย", 48L },
                    { 576L, "ไทยเจริญ", 46L },
                    { 578L, "มหาชนะชัย", 46L },
                    { 579L, "เมืองยโสธร", 46L },
                    { 580L, "เลิงนกทา", 46L },
                    { 581L, "กรงปินัง", 47L },
                    { 582L, "กาบัง", 47L },
                    { 583L, "ธารโต", 47L },
                    { 584L, "บันนังสตา", 47L },
                    { 585L, "เบตง", 47L },
                    { 586L, "เมืองยะลา", 47L },
                    { 587L, "ยะหา", 47L },
                    { 577L, "ป่าติ้ว", 46L },
                    { 718L, "กระแสสินธุ์", 58L },
                    { 719L, "คลองหอยโข่ง", 58L },
                    { 720L, "ควนเนียง", 58L },
                    { 851L, "ป่าโมก", 72L },
                    { 852L, "โพธิ์ทอง", 72L },
                    { 853L, "เมืองอ่างทอง", 72L },
                    { 854L, "วิเศษชัยชาญ", 72L },
                    { 855L, "สามโก้", 72L },
                    { 856L, "แสวงหา", 72L },
                    { 857L, "ชานุมาน", 73L },
                    { 858L, "ปทุมราชวงศา", 73L },
                    { 859L, "พนา", 73L },
                    { 860L, "เมืองอำนาจเจริญ", 73L },
                    { 861L, "ลืออำนาจ", 73L },
                    { 862L, "เสนางคนิคม", 73L },
                    { 863L, "หัวตะพาน", 73L },
                    { 864L, "กุดจับ", 74L },
                    { 865L, "กุมภวาปี", 74L },
                    { 866L, "กู่แก้ว", 74L },
                    { 867L, "ไชยวาน", 74L },
                    { 868L, "ทุ่งฝน", 74L },
                    { 869L, "นายูง", 74L },
                    { 870L, "น้ำโสม", 74L },
                    { 871L, "โนนสะอาด", 74L },
                    { 850L, "ไชโย", 72L },
                    { 849L, "สุวรรณคูหา", 71L },
                    { 848L, "ศรีบุญเรือง", 71L },
                    { 847L, "เมืองหนองบัวลำภู", 71L },
                    { 825L, "ปราสาท", 69L },
                    { 826L, "พนมดงรัก", 69L },
                    { 827L, "เมืองสุรินทร์", 69L },
                    { 828L, "รัตนบุรี", 69L },
                    { 829L, "ลำดวน", 69L },
                    { 830L, "ศรีณรงค์", 69L },
                    { 831L, "ศีขรภูมิ", 69L },
                    { 832L, "สนม", 69L },
                    { 833L, "สังขะ", 69L },
                    { 834L, "สำโรงทาบ", 69L },
                    { 872L, "บ้านดุง", 74L },
                    { 835L, "ท่าบ่อ", 70L },
                    { 837L, "โพธิ์ตาก", 70L },
                    { 838L, "โพนพิสัย", 70L },
                    { 839L, "เมืองหนองคาย", 70L },
                    { 840L, "รัตนวาปี", 70L },
                    { 841L, "ศรีเชียงใหม่", 70L },
                    { 842L, "สระใคร", 70L },
                    { 843L, "สังคม", 70L },
                    { 844L, "นากลาง", 71L },
                    { 845L, "นาวัง", 71L },
                    { 846L, "โนนสัง", 71L },
                    { 836L, "เฝ้าไร่", 70L },
                    { 873L, "บ้านผือ", 74L },
                    { 874L, "ประจักษ์ศิลปาคม", 74L },
                    { 875L, "พิบูลย์รักษ์", 74L },
                    { 902L, "เขมราฐ", 77L },
                    { 903L, "เขื่องใน", 77L },
                    { 904L, "โขงเจียม", 77L },
                    { 905L, "ดอนมดแดง", 77L },
                    { 906L, "เดชอุดม", 77L },
                    { 907L, "ตระการพืชผล", 77L },
                    { 908L, "ตาลสุม", 77L },
                    { 909L, "ทุ่งศรีอุดม", 77L },
                    { 910L, "นาจะหลวย", 77L },
                    { 911L, "นาตาล", 77L },
                    { 901L, "กุดข้าวปุ้น", 77L },
                    { 912L, "นาเยีย", 77L },
                    { 914L, "น้ำยืน", 77L },
                    { 915L, "บุณฑริก", 77L },
                    { 916L, "พิบูลมังสาหาร", 77L },
                    { 917L, "โพธิ์ไทร", 77L },
                    { 918L, "ม่วงสามสิบ", 77L },
                    { 919L, "เมืองอุบลราชธานี", 77L },
                    { 920L, "วารินชำราบ", 77L },
                    { 921L, "ศรีเมืองใหม่", 77L },
                    { 922L, "สว่างวีระวงศ์", 77L },
                    { 923L, "สำโรง", 77L },
                    { 913L, "น้ำขุ่น", 77L },
                    { 824L, "บัวเชด", 69L },
                    { 900L, "ห้วยคต", 76L },
                    { 898L, "หนองขาหย่าง", 76L },
                    { 876L, "เพ็ญ", 74L },
                    { 877L, "เมืองอุดรธานี", 74L },
                    { 878L, "วังสามหมอ", 74L },
                    { 879L, "ศรีธาตุ", 74L },
                    { 880L, "สร้างคอม", 74L },
                    { 881L, "หนองวัวซอ", 74L },
                    { 882L, "หนองแสง", 74L },
                    { 883L, "หนองหาน", 74L },
                    { 884L, "ตรอน", 75L },
                    { 885L, "ทองแสนขัน", 75L },
                    { 899L, "หนองฉาง", 76L },
                    { 886L, "ท่าปลา", 75L },
                    { 888L, "บ้านโคก", 75L },
                    { 889L, "พิชัย", 75L },
                    { 890L, "ฟากท่า", 75L },
                    { 891L, "เมืองอุตรดิตถ์", 75L },
                    { 892L, "ลับแล", 75L },
                    { 893L, "ทัพทัน", 76L },
                    { 894L, "บ้านไร่", 76L },
                    { 895L, "เมืองอุทัยธานี", 76L },
                    { 896L, "ลานสัก", 76L },
                    { 897L, "สว่างอารมณ์", 76L },
                    { 887L, "น้ำปาด", 75L },
                    { 823L, "โนนนารายณ์", 69L },
                    { 822L, "ท่าตูม", 69L },
                    { 821L, "ชุมพลบุรี", 69L },
                    { 747L, "บางคนที", 61L },
                    { 748L, "เมืองสมุทรสงคราม", 61L },
                    { 749L, "อัมพวา", 61L },
                    { 750L, "กระทุ่มแบน", 62L },
                    { 751L, "บ้านแพ้ว", 62L },
                    { 752L, "เมืองสมุทรสาคร", 62L },
                    { 753L, "เขาฉกรรจ์", 63L },
                    { 754L, "คลองหาด", 63L },
                    { 755L, "โคกสูง", 63L },
                    { 756L, "ตาพระยา", 63L },
                    { 746L, "เมืองสมุทรปราการ", 60L },
                    { 757L, "เมืองสระแก้ว", 63L },
                    { 759L, "วังสมบูรณ์", 63L },
                    { 760L, "วัฒนานคร", 63L },
                    { 761L, "อรัญประเทศ", 63L },
                    { 762L, "แก่งคอย", 64L },
                    { 763L, "ดอนพุด", 64L },
                    { 764L, "บ้านหมอ", 64L },
                    { 765L, "พระพุทธบาท", 64L },
                    { 766L, "มวกเหล็ก", 64L },
                    { 767L, "เมืองสระบุรี", 64L },
                    { 768L, "วังม่วง", 64L },
                    { 758L, "วังน้ำเย็น", 63L },
                    { 769L, "วิหารแดง", 64L },
                    { 745L, "พระสมุทรเจดีย์", 60L },
                    { 743L, "บางเสาธง", 60L },
                    { 721L, "จะนะ", 58L },
                    { 722L, "เทพา", 58L },
                    { 723L, "นาทวี", 58L },
                    { 724L, "นาหม่อม", 58L },
                    { 725L, "บางกล่ำ", 58L },
                    { 726L, "เมืองสงขลา", 58L },
                    { 727L, "ระโนด", 58L },
                    { 728L, "รัตภูมิ", 58L },
                    { 729L, "สทิงพระ", 58L },
                    { 730L, "สะเดา", 58L },
                    { 514L, "วัดโบสถ์", 38L },
                    { 731L, "สะบ้าย้อย", 58L },
                    { 733L, "หาดใหญ่", 58L },
                    { 734L, "ควนกาหลง", 59L },
                    { 735L, "ควนโดน", 59L },
                    { 736L, "ท่าแพ", 59L },
                    { 737L, "ทุ่งหว้า", 59L },
                    { 738L, "มะนัง", 59L },
                    { 739L, "เมืองสตูล", 59L },
                    { 740L, "ละงู", 59L },
                    { 741L, "บางบ่อ", 60L },
                    { 742L, "บางพลี", 60L },
                    { 732L, "สิงหนคร", 58L },
                    { 925L, "เหล่าเสือโก้ก", 77L },
                    { 770L, "เสาไห้", 64L },
                    { 772L, "หนองแซง", 64L },
                    { 799L, "กาญจนดิษฐ์", 68L },
                    { 800L, "เกาะพะงัน", 68L },
                    { 801L, "เกาะสมุย", 68L },
                    { 802L, "คีรีรัฐนิคม", 68L },
                    { 803L, "เคียนซา", 68L },
                    { 804L, "ชัยบุรี", 68L },
                    { 805L, "ไชยา", 68L },
                    { 806L, "ดอนสัก", 68L },
                    { 807L, "ท่าฉาง", 68L },
                    { 808L, "ท่าชนะ", 68L },
                    { 798L, "อู่ทอง", 67L },
                    { 809L, "บ้านตาขุน", 68L },
                    { 811L, "บ้านนาสาร", 68L },
                    { 812L, "พนม", 68L },
                    { 813L, "พระแสง", 68L },
                    { 814L, "พุนพิน", 68L },
                    { 815L, "เมืองสุราษฎร์ธานี", 68L },
                    { 816L, "วิภาวดี", 68L },
                    { 817L, "เวียงสระ", 68L },
                    { 818L, "กาบเชิง", 69L },
                    { 819L, "เขวาสินรินทร์", 69L },
                    { 820L, "จอมพระ", 69L },
                    { 810L, "บ้านนาเดิม", 68L },
                    { 771L, "หนองแค", 64L },
                    { 797L, "หนองหญ้าไซ", 67L },
                    { 795L, "สองพี่น้อง", 67L },
                    { 773L, "หนองโดน", 64L },
                    { 774L, "ค่ายบางระจัน", 65L },
                    { 775L, "ท่าช้าง", 65L },
                    { 776L, "บางระจัน", 65L },
                    { 777L, "พรหมบุรี", 65L },
                    { 778L, "เมืองสิงห์บุรี", 65L },
                    { 779L, "อินทร์บุรี", 65L },
                    { 780L, "กงไกรลาศ", 66L },
                    { 781L, "คีรีมาศ", 66L },
                    { 782L, "ทุ่งเสลี่ยม", 66L },
                    { 796L, "สามชุก", 67L },
                    { 783L, "บ้านด่านลานหอย", 66L },
                    { 785L, "ศรีนคร", 66L },
                    { 786L, "ศรีสัชนาลัย", 66L },
                    { 787L, "ศรีสำโรง", 66L },
                    { 788L, "สวรรคโลก", 66L },
                    { 789L, "ดอนเจดีย์", 67L },
                    { 790L, "ด่านช้าง", 67L },
                    { 791L, "เดิมบางนางบวช", 67L },
                    { 792L, "บางปลาม้า", 67L },
                    { 793L, "เมืองสุพรรณบุรี", 67L },
                    { 794L, "ศรีประจันต์", 67L },
                    { 784L, "เมืองสุโขทัย", 66L },
                    { 744L, "พระประแดง", 60L },
                    { 513L, "วังทอง", 38L },
                    { 511L, "พรหมพิราม", 38L },
                    { 197L, "พญาเม็งราย", 13L },
                    { 198L, "พาน", 13L },
                    { 199L, "เมืองเชียงราย", 13L },
                    { 200L, "แม่จัน", 13L },
                    { 201L, "แม่ฟ้าหลวง", 13L },
                    { 202L, "แม่ลาว", 13L },
                    { 203L, "แม่สรวย", 13L },
                    { 204L, "แม่สาย", 13L },
                    { 205L, "เวียงแก่น", 13L },
                    { 206L, "เวียงชัย", 13L },
                    { 207L, "เวียงเชียงรุ้ง", 13L },
                    { 196L, "ป่าแดด", 13L },
                    { 208L, "เวียงป่าเป้า", 13L },
                    { 210L, "จอมทอง", 14L },
                    { 211L, "เชียงดาว", 14L },
                    { 212L, "ไชยปราการ", 14L },
                    { 213L, "ดอยเต่า", 14L },
                    { 214L, "ดอยสะเก็ด", 14L },
                    { 215L, "ดอยหล่อ", 14L },
                    { 216L, "ฝาง", 14L },
                    { 217L, "พร้าว", 14L },
                    { 218L, "เมืองเชียงใหม่", 14L },
                    { 219L, "แม่แจ่ม", 14L },
                    { 220L, "แม่แตง", 14L },
                    { 209L, "กัลยาณิวัฒนา", 14L },
                    { 195L, "เทิง", 13L },
                    { 194L, "ดอยหลวง", 13L },
                    { 193L, "เชียงแสน", 13L },
                    { 168L, "แก้งคร้อ", 11L },
                    { 169L, "คอนสวรรค์", 11L },
                    { 170L, "คอนสาร", 11L },
                    { 171L, "จัตุรัส", 11L },
                    { 172L, "ซับใหญ่", 11L },
                    { 173L, "เทพสถิต", 11L },
                    { 174L, "เนินสง่า", 11L },
                    { 175L, "บ้านเขว้า", 11L },
                    { 176L, "บ้านแท่น", 11L },
                    { 177L, "บำเหน็จณรงค์", 11L },
                    { 178L, "ภักดีชุมพล", 11L },
                    { 179L, "ภูเขียว", 11L },
                    { 180L, "เมืองชัยภูมิ", 11L },
                    { 181L, "หนองบัวแดง", 11L },
                    { 182L, "หนองบัวระเหว", 11L },
                    { 183L, "ท่าแซะ", 12L },
                    { 184L, "ทุ่งตะโก", 12L },
                    { 185L, "ปะทิว", 12L },
                    { 186L, "พะโต๊ะ", 12L },
                    { 187L, "เมืองชุมพร", 12L },
                    { 188L, "ละแม", 12L },
                    { 189L, "สวี", 12L },
                    { 190L, "หลังสวน", 12L },
                    { 191L, "ขุนตาล", 13L },
                    { 192L, "เชียงของ", 13L },
                    { 221L, "แม่ริม", 14L },
                    { 222L, "แม่วาง", 14L },
                    { 223L, "แม่ออน", 14L },
                    { 224L, "แม่อาย", 14L },
                    { 254L, "เมืองตาก", 17L },
                    { 255L, "แม่ระมาด", 17L },
                    { 256L, "แม่สอด", 17L },
                    { 257L, "วังเจ้า", 17L },
                    { 258L, "สามเงา", 17L },
                    { 259L, "อุ้มผาง", 17L },
                    { 260L, "บ้านนา", 18L },
                    { 261L, "ปากพลี", 18L },
                    { 262L, "เมืองนครนายก", 18L },
                    { 263L, "องครักษ์", 18L },
                    { 264L, "กำแพงแสน", 19L },
                    { 265L, "ดอนตูม", 19L },
                    { 266L, "นครชัยศรี", 19L },
                    { 267L, "บางเลน", 19L },
                    { 268L, "พุทธมณฑล", 19L },
                    { 269L, "เมืองนครปฐม", 19L },
                    { 270L, "สามพราน", 19L },
                    { 271L, "ท่าอุเทน", 20L },
                    { 272L, "ธาตุพนม", 20L },
                    { 273L, "นาแก", 20L },
                    { 274L, "นาทม", 20L },
                    { 275L, "นาหว้า", 20L },
                    { 276L, "บ้านแพง", 20L },
                    { 277L, "ปลาปาก", 20L },
                    { 278L, "โพนสวรรค์", 20L },
                    { 253L, "พบพระ", 17L },
                    { 167L, "เกษตรสมบูรณ์", 11L },
                    { 252L, "บ้านตาก", 17L },
                    { 250L, "แหลมงอบ", 16L },
                    { 225L, "เวียงแหง", 14L },
                    { 226L, "สะเมิง", 14L },
                    { 227L, "สันกำแพง", 14L },
                    { 228L, "สันทราย", 14L },
                    { 229L, "สันป่าตอง", 14L },
                    { 230L, "สารภี", 14L },
                    { 231L, "หางดง", 14L },
                    { 232L, "อมก๋อย", 14L },
                    { 233L, "ฮอด", 14L },
                    { 234L, "กันตัง", 15L },
                    { 235L, "นาโยง", 15L },
                    { 236L, "ปะเหลียน", 15L },
                    { 237L, "เมืองตรัง", 15L },
                    { 238L, "ย่านตาขาว", 15L },
                    { 239L, "รัษฎา", 15L },
                    { 240L, "วังวิเศษ", 15L },
                    { 241L, "สิเกา", 15L },
                    { 242L, "ห้วยยอด", 15L },
                    { 243L, "หาดสำราญ", 15L },
                    { 244L, "เกาะกูด", 16L },
                    { 245L, "เกาะช้าง", 16L },
                    { 246L, "เขาสมิง", 16L },
                    { 247L, "คลองใหญ่", 16L },
                    { 248L, "บ่อไร่", 16L },
                    { 249L, "เมืองตราด", 16L },
                    { 251L, "ท่าสองยาง", 17L },
                    { 166L, "หันคา", 10L },
                    { 165L, "หนองมะโมง", 10L },
                    { 164L, "สรรพยา", 10L },
                    { 81L, "เมืองกาฬสินธุ์", 4L },
                    { 82L, "ยางตลาด", 4L },
                    { 83L, "ร่องคำ", 4L },
                    { 84L, "สมเด็จ", 4L },
                    { 85L, "สหัสขันธ์", 4L },
                    { 86L, "สามชัย", 4L },
                    { 87L, "หนองกุงศรี", 4L },
                    { 88L, "ห้วยผึ้ง", 4L },
                    { 89L, "ห้วยเม็ก", 4L },
                    { 90L, "โกสัมพีนคร", 5L },
                    { 91L, "ขาณุวรลักษบุรี", 5L },
                    { 92L, "คลองขลุง", 5L },
                    { 93L, "คลองลาน", 5L },
                    { 94L, "ทรายทองวัฒนา", 5L },
                    { 95L, "ไทรงาม", 5L },
                    { 96L, "บึงสามัคคี", 5L },
                    { 97L, "ปางศิลาทอง", 5L },
                    { 98L, "พรานกระต่าย", 5L },
                    { 99L, "เมืองกำแพงเพชร", 5L },
                    { 100L, "ลานกระบือ", 5L },
                    { 101L, "กระนวน", 6L },
                    { 102L, "เขาสวนกวาง", 6L },
                    { 103L, "โคกโพธิ์ไชย", 6L },
                    { 104L, "ชนบท", 6L },
                    { 105L, "ชุมแพ", 6L },
                    { 80L, "นามน", 4L },
                    { 106L, "ซำสูง", 6L },
                    { 79L, "นาคู", 4L },
                    { 77L, "ดอนจาน", 4L },
                    { 52L, "เขาพนม", 2L },
                    { 53L, "คลองท่อม", 2L },
                    { 54L, "ปลายพระยา", 2L },
                    { 55L, "เมืองกระบี่", 2L },
                    { 56L, "ลำทับ", 2L },
                    { 57L, "เหนือคลอง", 2L },
                    { 58L, "อ่าวลึก", 2L },
                    { 59L, "ด่านมะขามเตี้ย", 3L },
                    { 60L, "ทองผาภูมิ", 3L },
                    { 61L, "ท่าม่วง", 3L },
                    { 62L, "ท่ามะกา", 3L },
                    { 63L, "ไทรโยค", 3L },
                    { 64L, "บ่อพลอย", 3L },
                    { 65L, "พนมทวน", 3L },
                    { 66L, "เมืองกาญจนบุรี", 3L },
                    { 67L, "เลาขวัญ", 3L },
                    { 68L, "ศรีสวัสดิ์", 3L },
                    { 69L, "สังขละบุรี", 3L },
                    { 70L, "หนองปรือ", 3L },
                    { 71L, "ห้วยกระเจา", 3L },
                    { 72L, "กมลาไสย", 4L },
                    { 73L, "กุฉินารายณ์", 4L },
                    { 74L, "เขาวง", 4L },
                    { 75L, "คำม่วง", 4L },
                    { 76L, "ฆ้องชัย", 4L },
                    { 78L, "ท่าคันโท", 4L },
                    { 279L, "เมืองนครพนม", 20L },
                    { 107L, "น้ำพอง", 6L },
                    { 109L, "บ้านไผ่", 6L },
                    { 139L, "บางคล้า", 8L },
                    { 140L, "บางน้ำเปรี้ยว", 8L },
                    { 141L, "บางปะกง", 8L },
                    { 142L, "บ้านโพธิ์", 8L },
                    { 143L, "แปลงยาว", 8L },
                    { 144L, "พนมสารคาม", 8L },
                    { 145L, "เมืองฉะเชิงเทรา", 8L },
                    { 146L, "ราชสาส์น", 8L },
                    { 147L, "สนามชัยเขต", 8L },
                    { 148L, "เกาะจันทร์", 9L },
                    { 149L, "เกาะสีชัง", 9L },
                    { 150L, "บ่อทอง", 9L },
                    { 151L, "บางละมุง", 9L },
                    { 152L, "บ้านบึง", 9L },
                    { 153L, "พนัสนิคม", 9L },
                    { 154L, "พานทอง", 9L },
                    { 155L, "เมืองชลบุรี", 9L },
                    { 156L, "ศรีราชา", 9L },
                    { 157L, "สัตหีบ", 9L },
                    { 158L, "หนองใหญ่", 9L },
                    { 159L, "เนินขาม", 10L },
                    { 160L, "มโนรมย์", 10L },
                    { 161L, "เมืองชัยนาท", 10L },
                    { 162L, "วัดสิงห์", 10L },
                    { 163L, "สรรคบุรี", 10L },
                    { 138L, "ท่าตะเกียบ", 8L },
                    { 108L, "โนนศิลา", 6L },
                    { 137L, "คลองเขื่อน", 8L },
                    { 135L, "สอยดาว", 7L },
                    { 110L, "บ้านฝาง", 6L },
                    { 111L, "บ้านแฮด", 6L },
                    { 112L, "เปือยน้อย", 6L },
                    { 113L, "พระยืน", 6L },
                    { 114L, "พล", 6L },
                    { 115L, "ภูผาม่าน", 6L },
                    { 116L, "ภูเวียง", 6L },
                    { 117L, "มัญจาคีรี", 6L },
                    { 118L, "เมืองขอนแก่น", 6L },
                    { 119L, "เวียงเก่า", 6L },
                    { 120L, "แวงน้อย", 6L },
                    { 121L, "แวงใหญ่", 6L },
                    { 122L, "สีชมพู", 6L },
                    { 123L, "หนองนาคำ", 6L },
                    { 124L, "หนองเรือ", 6L },
                    { 125L, "หนองสองห้อง", 6L },
                    { 126L, "อุบลรัตน์", 6L },
                    { 127L, "แก่งหางแมว", 7L },
                    { 128L, "ขลุง", 7L },
                    { 129L, "เขาคิชฌกูฏ", 7L },
                    { 130L, "ท่าใหม่", 7L },
                    { 131L, "นายายอาม", 7L },
                    { 132L, "โป่งน้ำร้อน", 7L },
                    { 133L, "มะขาม", 7L },
                    { 134L, "เมืองจันทบุรี", 7L },
                    { 136L, "แหลมสิงห์", 7L },
                    { 280L, "เรณูนคร", 20L },
                    { 281L, "วังยาง", 20L },
                    { 282L, "ศรีสงคราม", 20L },
                    { 428L, "เมืองประจวบคีรีขันธ์", 30L },
                    { 429L, "สามร้อยยอด", 30L },
                    { 430L, "หัวหิน", 30L },
                    { 431L, "กบินทร์บุรี", 31L },
                    { 432L, "นาดี", 31L },
                    { 433L, "บ้านสร้าง", 31L },
                    { 434L, "ประจันตคาม", 31L },
                    { 435L, "เมืองปราจีนบุรี", 31L },
                    { 436L, "ศรีมหาโพธิ", 31L },
                    { 437L, "ศรีมโหสถ", 31L },
                    { 438L, "กะพ้อ", 32L },
                    { 439L, "โคกโพธิ์", 32L },
                    { 440L, "ทุ่งยางแดง", 32L },
                    { 441L, "ปะนาเระ", 32L },
                    { 442L, "มายอ", 32L },
                    { 443L, "เมืองปัตตานี", 32L },
                    { 444L, "แม่ลาน", 32L },
                    { 445L, "ไม้แก่น", 32L },
                    { 446L, "ยะรัง", 32L },
                    { 447L, "ยะหริ่ง", 32L },
                    { 448L, "สายบุรี", 32L }
                });

            migrationBuilder.InsertData(
                table: "Districts",
                columns: new[] { "Id", "Name", "ProvinceId" },
                values: new object[,]
                {
                    { 449L, "หนองจิก", 32L },
                    { 450L, "ท่าเรือ", 33L },
                    { 451L, "นครหลวง", 33L },
                    { 452L, "บางซ้าย", 33L },
                    { 427L, "ปราณบุรี", 30L },
                    { 453L, "บางไทร", 33L },
                    { 426L, "บางสะพานน้อย", 30L },
                    { 424L, "ทับสะแก", 30L },
                    { 399L, "นาโพธิ์", 28L },
                    { 400L, "โนนดินแดง", 28L },
                    { 401L, "โนนสุวรรณ", 28L },
                    { 402L, "บ้านกรวด", 28L },
                    { 403L, "บ้านด่าน", 28L },
                    { 404L, "บ้านใหม่ไชยพจน์", 28L },
                    { 405L, "ประโคนชัย", 28L },
                    { 406L, "ปะคำ", 28L },
                    { 407L, "พลับพลาชัย", 28L },
                    { 408L, "พุทไธสง", 28L },
                    { 409L, "เมืองบุรีรัมย์", 28L },
                    { 410L, "ละหานทราย", 28L },
                    { 411L, "ลำปลายมาศ", 28L },
                    { 412L, "สตึก", 28L },
                    { 413L, "หนองกี่", 28L },
                    { 414L, "หนองหงส์", 28L },
                    { 415L, "ห้วยราช", 28L },
                    { 416L, "คลองหลวง", 29L },
                    { 417L, "ธัญบุรี", 29L },
                    { 418L, "เมืองปทุมธานี", 29L },
                    { 419L, "ลาดหลุมแก้ว", 29L },
                    { 420L, "ลำลูกกา", 29L },
                    { 421L, "สามโคก", 29L },
                    { 422L, "หนองเสือ", 29L },
                    { 423L, "กุยบุรี", 30L },
                    { 425L, "บางสะพาน", 30L },
                    { 398L, "นางรอง", 28L },
                    { 454L, "บางบาล", 33L },
                    { 456L, "บางปะอิน", 33L },
                    { 486L, "ตะโหมด", 36L },
                    { 487L, "บางแก้ว", 36L },
                    { 488L, "ปากพะยูน", 36L },
                    { 489L, "ป่าบอน", 36L },
                    { 490L, "ป่าพะยอม", 36L },
                    { 491L, "เมืองพัทลุง", 36L },
                    { 492L, "ศรีนครินทร์", 36L },
                    { 493L, "ศรีบรรพต", 36L },
                    { 494L, "ดงเจริญ", 37L },
                    { 495L, "ตะพานหิน", 37L },
                    { 496L, "ทับคล้อ", 37L },
                    { 497L, "บางมูลนาก", 37L },
                    { 498L, "บึงนาราง", 37L },
                    { 499L, "โพทะเล", 37L },
                    { 500L, "โพธิ์ประทับช้าง", 37L },
                    { 501L, "เมืองพิจิตร", 37L },
                    { 502L, "วชิรบารมี", 37L },
                    { 503L, "วังทรายพูน", 37L },
                    { 504L, "สากเหล็ก", 37L },
                    { 505L, "สามง่าม", 37L },
                    { 506L, "ชาติตระการ", 38L },
                    { 507L, "นครไทย", 38L },
                    { 508L, "เนินมะปราง", 38L },
                    { 509L, "บางกระทุ่ม", 38L },
                    { 510L, "บางระกำ", 38L },
                    { 485L, "ควนขนุน", 36L },
                    { 455L, "บางปะหัน", 33L },
                    { 484L, "เขาชัยสน", 36L },
                    { 482L, "เมืองพังงา", 35L },
                    { 457L, "บ้านแพรก", 33L },
                    { 458L, "ผักไห่", 33L },
                    { 459L, "พระนครศรีอยุธยา", 33L },
                    { 460L, "ภาชี", 33L },
                    { 461L, "มหาราช", 33L },
                    { 462L, "ลาดบัวหลวง", 33L },
                    { 463L, "วังน้อย", 33L },
                    { 464L, "เสนา", 33L },
                    { 465L, "อุทัย", 33L },
                    { 466L, "จุน", 34L },
                    { 467L, "เชียงคำ", 34L },
                    { 468L, "เชียงม่วน", 34L },
                    { 469L, "ดอกคำใต้", 34L },
                    { 470L, "ปง", 34L },
                    { 471L, "ภูกามยาว", 34L },
                    { 472L, "ภูซาง", 34L },
                    { 473L, "เมืองพะเยา", 34L },
                    { 474L, "แม่ใจ", 34L },
                    { 475L, "กะปง", 35L },
                    { 476L, "เกาะยาว", 35L },
                    { 477L, "คุระบุรี", 35L },
                    { 478L, "ตะกั่วทุ่ง", 35L },
                    { 479L, "ตะกั่วป่า", 35L },
                    { 480L, "ทับปุด", 35L },
                    { 481L, "ท้ายเหมือง", 35L },
                    { 483L, "กงหรา", 36L },
                    { 512L, "เมืองพิษณุโลก", 38L },
                    { 397L, "ชำนิ", 28L },
                    { 395L, "คูเมือง", 28L },
                    { 312L, "เสิงสาง", 21L },
                    { 313L, "หนองบุญมาก", 21L },
                    { 314L, "ห้วยแถลง", 21L },
                    { 315L, "ขนอม", 22L },
                    { 316L, "จุฬาภรณ์", 22L },
                    { 317L, "ฉวาง", 22L },
                    { 318L, "ชะอวด", 22L },
                    { 319L, "ช้างกลาง", 22L },
                    { 320L, "เชียรใหญ่", 22L },
                    { 321L, "ถ้ำพรรณรา", 22L },
                    { 322L, "ท่าศาลา", 22L },
                    { 323L, "ทุ่งสง", 22L },
                    { 324L, "ทุ่งใหญ่", 22L },
                    { 325L, "นบพิตำ", 22L },
                    { 326L, "นาบอน", 22L },
                    { 327L, "บางขัน", 22L },
                    { 328L, "ปากพนัง", 22L },
                    { 329L, "พรหมคีรี", 22L },
                    { 330L, "พระพรหม", 22L },
                    { 331L, "พิปูน", 22L },
                    { 332L, "เมืองนครศรีธรรมราช", 22L },
                    { 333L, "ร่อนพิบูลย์", 22L },
                    { 334L, "ลานสกา", 22L },
                    { 335L, "สิชล", 22L },
                    { 336L, "หัวไทร", 22L },
                    { 311L, "สูงเนิน", 21L },
                    { 337L, "เก้าเลี้ยว", 23L },
                    { 310L, "สีดา", 21L },
                    { 308L, "วังน้ำเขียว", 21L },
                    { 283L, "แก้งสนามนาง", 21L },
                    { 284L, "ขามทะเลสอ", 21L },
                    { 285L, "ขามสะแกแสง", 21L },
                    { 286L, "คง", 21L },
                    { 287L, "ครบุรี", 21L },
                    { 288L, "จักราช", 21L },
                    { 289L, "เฉลิมพระเกียรติ", 21L },
                    { 290L, "ชุมพวง", 21L },
                    { 291L, "โชคชัย", 21L },
                    { 292L, "ด่านขุนทด", 21L },
                    { 293L, "เทพารักษ์", 21L },
                    { 294L, "โนนแดง", 21L },
                    { 295L, "โนนไทย", 21L },
                    { 296L, "โนนสูง", 21L },
                    { 297L, "บัวลาย", 21L },
                    { 298L, "บัวใหญ่", 21L },
                    { 299L, "บ้านเหลื่อม", 21L },
                    { 300L, "ประทาย", 21L },
                    { 301L, "ปักธงชัย", 21L },
                    { 302L, "ปากช่อง", 21L },
                    { 303L, "พระทองคำ", 21L },
                    { 304L, "พิมาย", 21L },
                    { 305L, "เมืองนครราชสีมา", 21L },
                    { 306L, "เมืองยาง", 21L },
                    { 307L, "ลำทะเมนชัย", 21L },
                    { 309L, "สีคิ้ว", 21L },
                    { 396L, "แคนดง", 28L },
                    { 338L, "โกรกพระ", 23L },
                    { 340L, "ชุมแสง", 23L },
                    { 370L, "สุไหงปาดี", 25L },
                    { 371L, "เฉลิมพระเกียรติ", 26L },
                    { 372L, "เชียงกลาง", 26L },
                    { 373L, "ท่าวังผา", 26L },
                    { 374L, "ทุ่งช้าง", 26L },
                    { 375L, "นาน้อย", 26L },
                    { 376L, "นาหมื่น", 26L },
                    { 377L, "บ่อเกลือ", 26L },
                    { 378L, "บ้านหลวง", 26L },
                    { 379L, "ปัว", 26L },
                    { 380L, "ภูเพียง", 26L },
                    { 381L, "เมืองน่าน", 26L },
                    { 382L, "แม่จริม", 26L },
                    { 383L, "เวียงสา", 26L },
                    { 384L, "สองแคว", 26L },
                    { 385L, "สันติสุข", 26L },
                    { 386L, "เซกา", 27L },
                    { 387L, "โซ่พิสัย", 27L },
                    { 388L, "บึงโขงหลง", 27L },
                    { 389L, "บุ่งคล้า", 27L },
                    { 390L, "ปากคาด", 27L },
                    { 391L, "พรเจริญ", 27L },
                    { 392L, "เมืองบึงกาฬ", 27L },
                    { 393L, "ศรีวิไล", 27L },
                    { 394L, "กระสัง", 28L },
                    { 369L, "สุไหงโก-ลก", 25L },
                    { 339L, "ชุมตาบง", 23L },
                    { 368L, "สุคิริน", 25L },
                    { 366L, "แว้ง", 25L },
                    { 341L, "ตากฟ้า", 23L },
                    { 342L, "ตาคลี", 23L },
                    { 343L, "ท่าตะโก", 23L },
                    { 344L, "บรรพตพิสัย", 23L },
                    { 345L, "พยุหะคีรี", 23L },
                    { 346L, "ไพศาลี", 23L },
                    { 347L, "เมืองนครสวรรค์", 23L },
                    { 348L, "แม่เปิน", 23L },
                    { 349L, "แม่วงก์", 23L },
                    { 350L, "ลาดยาว", 23L },
                    { 351L, "หนองบัว", 23L },
                    { 352L, "ไทรน้อย", 24L },
                    { 353L, "บางกรวย", 24L },
                    { 354L, "บางบัวทอง", 24L },
                    { 355L, "บางใหญ่", 24L },
                    { 356L, "ปากเกร็ด", 24L },
                    { 357L, "เมืองนนทบุรี", 24L },
                    { 358L, "จะแนะ", 25L },
                    { 359L, "เจาะไอร้อง", 25L },
                    { 360L, "ตากใบ", 25L },
                    { 361L, "บาเจาะ", 25L },
                    { 362L, "เมืองนราธิวาส", 25L },
                    { 363L, "ยี่งอ", 25L },
                    { 364L, "ระแงะ", 25L },
                    { 365L, "รือเสาะ", 25L },
                    { 367L, "ศรีสาคร", 25L },
                    { 51L, "เกาะลันตา", 2L }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 51L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 52L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 53L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 54L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 55L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 56L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 57L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 58L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 59L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 60L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 61L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 62L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 63L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 64L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 65L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 66L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 67L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 68L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 69L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 70L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 71L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 72L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 73L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 74L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 75L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 76L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 77L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 78L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 79L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 80L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 81L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 82L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 83L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 84L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 85L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 86L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 87L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 88L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 89L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 90L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 91L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 92L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 93L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 94L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 95L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 96L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 97L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 98L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 99L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 100L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 101L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 102L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 103L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 104L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 105L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 106L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 107L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 108L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 109L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 110L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 111L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 112L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 113L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 114L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 115L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 116L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 117L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 118L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 119L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 120L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 121L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 122L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 123L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 124L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 125L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 126L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 127L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 128L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 129L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 130L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 131L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 132L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 133L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 134L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 135L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 136L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 137L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 138L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 139L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 140L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 141L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 142L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 143L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 144L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 145L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 146L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 147L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 148L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 149L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 150L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 151L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 152L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 153L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 154L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 155L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 156L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 157L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 158L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 159L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 160L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 161L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 162L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 163L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 164L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 165L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 166L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 167L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 168L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 169L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 170L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 171L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 172L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 173L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 174L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 175L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 176L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 177L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 178L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 179L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 180L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 181L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 182L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 183L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 184L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 185L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 186L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 187L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 188L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 189L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 190L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 191L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 192L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 193L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 194L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 195L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 196L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 197L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 198L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 199L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 200L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 201L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 202L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 203L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 204L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 205L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 206L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 207L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 208L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 209L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 210L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 211L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 212L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 213L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 214L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 215L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 216L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 217L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 218L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 219L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 220L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 221L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 222L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 223L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 224L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 225L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 226L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 227L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 228L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 229L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 230L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 231L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 232L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 233L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 234L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 235L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 236L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 237L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 238L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 239L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 240L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 241L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 242L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 243L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 244L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 245L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 246L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 247L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 248L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 249L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 250L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 251L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 252L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 253L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 254L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 255L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 256L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 257L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 258L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 259L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 260L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 261L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 262L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 263L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 264L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 265L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 266L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 267L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 268L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 269L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 270L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 271L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 272L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 273L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 274L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 275L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 276L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 277L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 278L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 279L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 280L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 281L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 282L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 283L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 284L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 285L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 286L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 287L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 288L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 289L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 290L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 291L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 292L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 293L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 294L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 295L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 296L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 297L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 298L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 299L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 300L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 301L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 302L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 303L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 304L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 305L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 306L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 307L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 308L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 309L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 310L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 311L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 312L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 313L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 314L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 315L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 316L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 317L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 318L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 319L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 320L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 321L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 322L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 323L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 324L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 325L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 326L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 327L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 328L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 329L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 330L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 331L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 332L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 333L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 334L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 335L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 336L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 337L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 338L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 339L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 340L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 341L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 342L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 343L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 344L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 345L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 346L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 347L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 348L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 349L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 350L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 351L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 352L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 353L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 354L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 355L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 356L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 357L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 358L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 359L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 360L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 361L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 362L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 363L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 364L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 365L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 366L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 367L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 368L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 369L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 370L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 371L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 372L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 373L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 374L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 375L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 376L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 377L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 378L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 379L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 380L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 381L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 382L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 383L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 384L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 385L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 386L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 387L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 388L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 389L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 390L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 391L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 392L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 393L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 394L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 395L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 396L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 397L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 398L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 399L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 400L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 401L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 402L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 403L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 404L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 405L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 406L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 407L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 408L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 409L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 410L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 411L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 412L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 413L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 414L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 415L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 416L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 417L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 418L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 419L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 420L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 421L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 422L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 423L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 424L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 425L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 426L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 427L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 428L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 429L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 430L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 431L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 432L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 433L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 434L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 435L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 436L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 437L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 438L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 439L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 440L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 441L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 442L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 443L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 444L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 445L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 446L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 447L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 448L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 449L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 450L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 451L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 452L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 453L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 454L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 455L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 456L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 457L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 458L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 459L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 460L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 461L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 462L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 463L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 464L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 465L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 466L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 467L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 468L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 469L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 470L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 471L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 472L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 473L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 474L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 475L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 476L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 477L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 478L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 479L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 480L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 481L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 482L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 483L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 484L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 485L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 486L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 487L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 488L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 489L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 490L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 491L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 492L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 493L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 494L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 495L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 496L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 497L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 498L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 499L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 500L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 501L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 502L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 503L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 504L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 505L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 506L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 507L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 508L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 509L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 510L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 511L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 512L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 513L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 514L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 515L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 516L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 517L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 518L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 519L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 520L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 521L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 522L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 523L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 524L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 525L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 526L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 527L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 528L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 529L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 530L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 531L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 532L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 533L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 534L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 535L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 536L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 537L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 538L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 539L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 540L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 541L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 542L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 543L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 544L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 545L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 546L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 547L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 548L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 549L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 550L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 551L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 552L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 553L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 554L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 555L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 556L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 557L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 558L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 559L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 560L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 561L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 562L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 563L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 564L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 565L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 566L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 567L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 568L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 569L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 570L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 571L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 572L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 573L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 574L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 575L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 576L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 577L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 578L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 579L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 580L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 581L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 582L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 583L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 584L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 585L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 586L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 587L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 588L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 589L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 590L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 591L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 592L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 593L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 594L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 595L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 596L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 597L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 598L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 599L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 600L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 601L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 602L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 603L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 604L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 605L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 606L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 607L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 608L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 609L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 610L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 611L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 612L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 613L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 614L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 615L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 616L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 617L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 618L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 619L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 620L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 621L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 622L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 623L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 624L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 625L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 626L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 627L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 628L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 629L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 630L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 631L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 632L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 633L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 634L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 635L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 636L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 637L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 638L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 639L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 640L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 641L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 642L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 643L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 644L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 645L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 646L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 647L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 648L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 649L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 650L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 651L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 652L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 653L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 654L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 655L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 656L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 657L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 658L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 659L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 660L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 661L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 662L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 663L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 664L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 665L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 666L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 667L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 668L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 669L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 670L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 671L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 672L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 673L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 674L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 675L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 676L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 677L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 678L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 679L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 680L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 681L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 682L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 683L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 684L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 685L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 686L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 687L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 688L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 689L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 690L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 691L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 692L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 693L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 694L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 695L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 696L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 697L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 698L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 699L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 700L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 701L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 702L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 703L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 704L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 705L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 706L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 707L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 708L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 709L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 710L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 711L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 712L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 713L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 714L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 715L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 716L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 717L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 718L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 719L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 720L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 721L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 722L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 723L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 724L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 725L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 726L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 727L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 728L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 729L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 730L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 731L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 732L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 733L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 734L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 735L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 736L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 737L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 738L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 739L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 740L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 741L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 742L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 743L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 744L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 745L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 746L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 747L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 748L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 749L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 750L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 751L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 752L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 753L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 754L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 755L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 756L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 757L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 758L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 759L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 760L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 761L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 762L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 763L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 764L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 765L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 766L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 767L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 768L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 769L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 770L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 771L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 772L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 773L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 774L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 775L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 776L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 777L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 778L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 779L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 780L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 781L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 782L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 783L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 784L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 785L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 786L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 787L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 788L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 789L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 790L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 791L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 792L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 793L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 794L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 795L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 796L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 797L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 798L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 799L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 800L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 801L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 802L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 803L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 804L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 805L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 806L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 807L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 808L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 809L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 810L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 811L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 812L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 813L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 814L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 815L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 816L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 817L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 818L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 819L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 820L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 821L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 822L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 823L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 824L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 825L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 826L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 827L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 828L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 829L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 830L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 831L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 832L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 833L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 834L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 835L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 836L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 837L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 838L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 839L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 840L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 841L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 842L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 843L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 844L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 845L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 846L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 847L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 848L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 849L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 850L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 851L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 852L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 853L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 854L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 855L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 856L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 857L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 858L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 859L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 860L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 861L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 862L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 863L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 864L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 865L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 866L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 867L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 868L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 869L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 870L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 871L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 872L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 873L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 874L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 875L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 876L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 877L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 878L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 879L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 880L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 881L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 882L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 883L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 884L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 885L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 886L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 887L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 888L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 889L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 890L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 891L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 892L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 893L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 894L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 895L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 896L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 897L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 898L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 899L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 900L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 901L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 902L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 903L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 904L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 905L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 906L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 907L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 908L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 909L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 910L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 911L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 912L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 913L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 914L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 915L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 916L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 917L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 918L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 919L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 920L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 921L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 922L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 923L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 924L);

            migrationBuilder.DeleteData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 925L);

            migrationBuilder.DropColumn(
                name: "EndDate",
                table: "FiscalYear");

            migrationBuilder.DropColumn(
                name: "StartDate",
                table: "FiscalYear");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 1L,
                column: "Name",
                value: "เขตพระนคร");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 2L,
                column: "Name",
                value: "เขตดุสิต");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 3L,
                column: "Name",
                value: "เขตหนองจอก");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 4L,
                column: "Name",
                value: "เขตบางรัก");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 5L,
                column: "Name",
                value: "เขตบางเขน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 6L,
                column: "Name",
                value: "เขตบางกะปิ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 7L,
                column: "Name",
                value: "เขตปทุมวัน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 8L,
                column: "Name",
                value: "เขตป้อมปราบศัตรูพ่าย");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 9L,
                column: "Name",
                value: "เขตพระโขนง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 10L,
                column: "Name",
                value: "เขตมีนบุรี");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 11L,
                column: "Name",
                value: "เขตลาดกระบัง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 12L,
                column: "Name",
                value: "เขตยานนาวา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 13L,
                column: "Name",
                value: "เขตสัมพันธวงศ์");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 14L,
                column: "Name",
                value: "เขตพญาไท");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 15L,
                column: "Name",
                value: "เขตธนบุรี");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 16L,
                column: "Name",
                value: "เขตบางกอกใหญ่");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 17L,
                column: "Name",
                value: "เขตห้วยขวาง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 18L,
                column: "Name",
                value: "เขตคลองสาน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 19L,
                column: "Name",
                value: "เขตตลิ่งชัน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 20L,
                column: "Name",
                value: "เขตบางกอกน้อย");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 21L,
                column: "Name",
                value: "เขตบางขุนเทียน");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 22L,
                column: "Name",
                value: "เขตภาษีเจริญ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 23L,
                column: "Name",
                value: "เขตหนองแขม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 24L,
                column: "Name",
                value: "เขตราษฎร์บูรณะ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 25L,
                column: "Name",
                value: "เขตบางพลัด");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 26L,
                column: "Name",
                value: "เขตดินแดง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 27L,
                column: "Name",
                value: "เขตบึงกุ่ม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 28L,
                column: "Name",
                value: "เขตสาทร");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 29L,
                column: "Name",
                value: "เขตบางซื่อ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 30L,
                column: "Name",
                value: "เขตจตุจักร");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 31L,
                column: "Name",
                value: "เขตบางคอแหลม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 32L,
                column: "Name",
                value: "เขตประเวศ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 33L,
                column: "Name",
                value: "เขตคลองเตย");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 34L,
                column: "Name",
                value: "เขตสวนหลวง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 35L,
                column: "Name",
                value: "เขตจอมทอง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 36L,
                column: "Name",
                value: "เขตดอนเมือง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 37L,
                column: "Name",
                value: "เขตราชเทวี");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 38L,
                column: "Name",
                value: "เขตลาดพร้าว");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 39L,
                column: "Name",
                value: "เขตวัฒนา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 40L,
                column: "Name",
                value: "เขตบางแค");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 41L,
                column: "Name",
                value: "เขตหลักสี่");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 42L,
                column: "Name",
                value: "เขตสายไหม");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 43L,
                column: "Name",
                value: "เขตคันนายาว");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 44L,
                column: "Name",
                value: "เขตสะพานสูง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 45L,
                column: "Name",
                value: "เขตวังทองหลาง");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 46L,
                column: "Name",
                value: "เขตคลองสามวา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 47L,
                column: "Name",
                value: "เขตบางนา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 48L,
                column: "Name",
                value: "เขตทวีวัฒนา");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 49L,
                column: "Name",
                value: "เขตทุ่งครุ");

            migrationBuilder.UpdateData(
                table: "Districts",
                keyColumn: "Id",
                keyValue: 50L,
                column: "Name",
                value: "เขตบางบอน");
        }
    }
}
