using System;
using Microsoft.EntityFrameworkCore.Migrations;

namespace InspecWeb.Data.Migrations
{
    public partial class EditExecutiveOrderSchema : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
           

            migrationBuilder.DropPrimaryKey(
                name: "PK_CentralPolicyUsers",
                table: "CentralPolicyUsers");

            migrationBuilder.DropIndex(
                name: "IX_CentralPolicyUsers_CentralPolicyId",
                table: "CentralPolicyUsers");

            migrationBuilder.AddColumn<string>(
                name: "AnswerUserId",
                table: "ExecutiveOrders",
                nullable: true);

            migrationBuilder.AddPrimaryKey(
                name: "PK_CentralPolicyUsers",
                table: "CentralPolicyUsers",
                columns: new[] { "CentralPolicyId", "UserId" });

            migrationBuilder.UpdateData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 1L,
                column: "Name",
                value: "กรมประชาสัมพันธ์");

            migrationBuilder.UpdateData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 2L,
                columns: new[] { "MinistryId", "Name" },
                values: new object[] { 1L, "สำนักงานสภาเศรษฐกิจและสังคมแห่งชาติ" });

            migrationBuilder.InsertData(
                table: "Departments",
                columns: new[] { "Id", "CreatedAt", "MinistryId", "Name" },
                values: new object[,]
                {
                    { 98L, null, 12L, "กรมพัฒนาธุรกิจการค้า" },
                    { 99L, null, 12L, "กรมเจรจาการค้าระหว่างประเทศ" },
                    { 101L, null, 12L, "สำนักงานนโยบายและยุทธศาสตร์การค้า" },
                    { 102L, null, 13L, "สำนักงานปลัดกระทรวงมหาดไทย" },
                    { 103L, null, 13L, "กรมการปกครอง" },
                    { 104L, null, 13L, "กรมการพัฒนาชุมชน" },
                    { 105L, null, 13L, "กรมส่งเสริมการปกครองท้องถิ่น" },
                    { 106L, null, 13L, "กรมที่ดิน" },
                    { 107L, null, 13L, "กรมโยธาธิการและผังเมือง" },
                    { 108L, null, 13L, "กรมป้องกันและบรรเทาสาธารณภัย" },
                    { 109L, null, 14L, "สำนักงานปลัดกระทรวงยุติธรรม" },
                    { 110L, null, 14L, "กรมคุมประพฤติ" },
                    { 111L, null, 14L, "กรมราชทัณฑ์" },
                    { 97L, null, 12L, "กรมการค้าต่างประเทศ" },
                    { 96L, null, 12L, "กรมการค้าภายใน" },
                    { 95L, null, 12L, "กรมส่งเสริมการค้าระหว่างประเทศ" },
                    { 94L, null, 12L, "กรมทรัพย์สินทางปัญญา" },
                    { 79L, null, 9L, "สำนักงานปลัดกระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม" },
                    { 80L, null, 9L, "กรมควบคุมมลพิษ" },
                    { 81L, null, 9L, "กรมทรัพยากรทางทะเลและชายฝั่ง" },
                    { 82L, null, 9L, "กรมทรัพยากรธรณี" },
                    { 83L, null, 9L, "กรมทรัพยากรน้ำ" },
                    { 84L, null, 9L, "กรมทรัพยากรน้ำบาดาล" },
                    { 112L, null, 14L, "กรมบังคับคดี" },
                    { 86L, null, 9L, "กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช" },
                    { 88L, null, 9L, "กรมป่าไม้" },
                    { 89L, null, 10L, "สำนักงานปลัดกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม" },
                    { 90L, null, 10L, "สำนักงานสถิติแห่งชาติ" },
                    { 91L, null, 10L, "กรมอุตุนิยมวิทยา" },
                    { 92L, null, 10L, "สำนักงานคณะกรรมการดิจิทัลเพื่อเศรษฐกิจและสังคมแห่งชาติ" },
                    { 93L, null, 12L, "สำนักงานปลัดกระทรวงพาณิชย์" },
                    { 87L, null, 9L, "สำนักงานนโยบายและแผนทรัพยากรธรรมชาติและสิ่งแวดล้อม" },
                    { 113L, null, 14L, "กรมสอบสวนคดีพิเศษ" },
                    { 114L, null, 14L, "กรมคุ้มครองสิทธิและเสรีภาพ" },
                    { 115L, null, 14L, "กรมพินิจและคุ้มครองเด็กและเยาวชน" },
                    { 135L, null, 18L, "กรมควบคุมโรค" },
                    { 136L, null, 18L, "กรมอนามัย" },
                    { 137L, null, 18L, "กรมการแพทย์" },
                    { 138L, null, 18L, "กรมวิทยาศาสตร์การแพทย์" },
                    { 139L, null, 18L, "กรมสนับสนุนบริการสุขภาพ" },
                    { 140L, null, 18L, "กรมการแพทย์แผนไทยและการแพทย์ทางเลือก" },
                    { 134L, null, 18L, "กรมสุขภาพจิต" },
                    { 141L, null, 18L, "สำนักงานคณะกรรมการอาหารและยา" },
                    { 143L, null, 19L, "กรมส่งเสริมอุตสาหกรรม" },
                    { 144L, null, 19L, "กรมโรงงานอุตสาหกรรม" },
                    { 145L, null, 19L, "สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม" },
                    { 146L, null, 19L, "สำนักงานเศรษฐกิจอุตสาหกรรม" },
                    { 147L, null, 19L, "กรมอุตสาหกรรมพื้นฐานและการเหมืองแร่" },
                    { 148L, null, 19L, "สำนักงานคณะกรรมการอ้อยและน้ำตาลทราย" },
                    { 142L, null, 19L, "สำนักงานปลัดอุตสาหกรรม" },
                    { 133L, null, 18L, "สำนักงานปลัดกระทรวงสาธารณสุข" },
                    { 132L, null, 17L, "สถาบันอุดมศึกษาของรัฐที่เป็นส่วนราชการ" },
                    { 131L, null, 17L, "สำนักงานการวิจัยแห่งชาติ" },
                    { 116L, null, 15L, "สำนักงานปลัดกระทรวงแรงงาน" },
                    { 117L, null, 15L, "กรมการจัดหางาน" },
                    { 118L, null, 15L, "กรมสวัสดิการและคุ้มครองแรงงาน" },
                    { 119L, null, 15L, "สำนักงานประกันสังคม" },
                    { 120L, null, 15L, "กรมพัฒนาฝีมือแรงงาน" },
                    { 121L, null, 16L, "สำนักงานปลัดกระทรวงวัฒนธรรม" },
                    { 122L, null, 16L, "กรมการศาสนา" },
                    { 123L, null, 16L, "กรมศิลปากร" },
                    { 124L, null, 16L, "กรมส่งเสริมวัฒนธรรม" },
                    { 125L, null, 16L, "สำนักงานศิลปวัฒนธรรมร่วมสมัย" },
                    { 126L, null, 16L, "สถาบันบัณฑิตพัฒนศิลป์" },
                    { 127L, null, 16L, "กรมพิธีการ" },
                    { 128L, null, 17L, "สำนักงานปลัดกระทรวง" },
                    { 129L, null, 17L, "กรมวิทยาศาสตร์บริการ" },
                    { 130L, null, 17L, "สำนักงานปรมาณูเพื่อสันติ" },
                    { 78L, null, 8L, "สำนักงานนโยบายและแผนการขนส่งและจราจร" },
                    { 77L, null, 8L, "กรมท่าอากาศยาน" },
                    { 85L, null, 9L, "กรมส่งเสริมคุณภาพสิ่งแวดล้อม" },
                    { 75L, null, 8L, "กรมทางหลวง" },
                    { 22L, null, 3L, "สำนักงานปลัดกระทรวงกระทรวงการคลัง" },
                    { 23L, null, 3L, "กรมธนารักษ์" },
                    { 24L, null, 3L, "กรมบัญชีกลาง" },
                    { 25L, null, 3L, " กรมศุลกากร" },
                    { 26L, null, 3L, "กรมสรรพสามิต" },
                    { 27L, null, 3L, "กรมสรรพากร" },
                    { 21L, null, 2L, "สำนักงานเลขาธิการสภาการศึกษา" },
                    { 30L, null, 3L, "สำนักงานบริหารหนี้สาธารณะ" },
                    { 76L, null, 8L, "กรมทางหลวงชนบท" },
                    { 33L, null, 4L, "สำนักงานปลัดกระทรวงกระทรวงการต่างประเทศ" },
                    { 34L, null, 4L, "กรมพิธีการทูต " },
                    { 35L, null, 4L, "กรมยุโรป" },
                    { 36L, null, 4L, "กรมเศรษฐกิจระหว่างประเทศ" },
                    { 37L, null, 4L, "กรมสนธิสัญญาและกฎหมาย " },
                    { 31L, null, 3L, "สำนักงานเศรษฐกิจการคลัง" },
                    { 38L, null, 4L, "กรมสารนิเทศ " },
                    { 20L, null, 2L, "สำนักงานคณะกรรมการการอาชีวศึกษา" },
                    { 18L, null, 2L, "สำนักงานปลัดกระทรวงศึกษาธิการ" },
                    { 4L, null, 1L, "สำนักงานคณะกรรมการส่งเสริมการลงทุน" },
                    { 5L, null, 1L, "สำนักเลขาธิการนายกรัฐมนตรี" },
                    { 6L, null, 1L, "สำนักงานปลัดสำนักนายกรัฐมนตรี" },
                    { 7L, null, 1L, "สำนักเลขาธิการคณะรัฐมนตรี" },
                    { 8L, null, 1L, "สำนักข่าวกรองแห่งชาติ" },
                    { 9L, null, 1L, "สำนักงานสภาความมั่นคงแห่งชาติ" },
                    { 19L, null, 2L, "สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน" },
                    { 10L, null, 1L, "สำนักงานคณะกรรมการกฤษฎีกา" },
                    { 12L, null, 1L, "สำนักงานคณะกรรมการการพัฒนาระบบราชการ" },
                    { 13L, null, 1L, "สำนักงานทรัพยากรน้ำแห่งชาติ" },
                    { 14L, null, 1L, "สำนักงานคณะกรรมการคุ้มครองผู้บริโภค" },
                    { 15L, null, 1L, "กองอำนวยการรักษาความมั่นคงภายในราชอาณาจักร" },
                    { 16L, null, 1L, "สำนักงานคณะกรรมการพิเศษเพื่อประสานงานโครงการอันเนื่องมาจากพระราชดำริ" },
                    { 17L, null, 1L, "สำนักงานพระพุทธศาสนาแห่งชาติ" },
                    { 11L, null, 1L, "สำนักงานคณะกรรมการข้าราชการพลเรือน" },
                    { 39L, null, 4L, "กรมองค์การระหว่างประเทศ" },
                    { 32L, null, 3L, "สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ" },
                    { 41L, null, 4L, "กรมอาเซียน " },
                    { 61L, null, 7L, "กรมพัฒนาที่ดิน " },
                    { 62L, null, 7L, "กรมวิชาการเกษตร " },
                    { 63L, null, 7L, "กรมส่งเสริมการเกษตร" },
                    { 64L, null, 7L, "กรมส่งเสริมสหกรณ์" },
                    { 65L, null, 7L, "สำนักงานการปฏิรูปที่ดินเพื่อเกษตรกรรม" },
                    { 40L, null, 4L, "กรมอเมริกาและแปซิฟิกใต้ " },
                    { 60L, null, 7L, "กรมปศุสัตว์" },
                    { 67L, null, 7L, "สำนักงานเศรษฐกิจการเกษตร " },
                    { 69L, null, 7L, "กรมการข้าว" },
                    { 70L, null, 7L, "กรมหม่อนไหม" },
                    { 71L, null, 8L, "สำนักงานปลัดกระทรวงคมนาคม" },
                    { 72L, null, 8L, "กรมการขนส่งทางราง" },
                    { 73L, null, 8L, "กรมขนส่งทางบก" },
                    { 74L, null, 8L, "กรมเจ้าท่า" },
                    { 68L, null, 7L, "กรมฝนหลวงและการบินเกษตร" },
                    { 59L, null, 7L, "กรมประมง" },
                    { 66L, null, 7L, "สำนักงานมาตรฐานสินค้าเกษตรและอาหารแห่งชาติ" },
                    { 57L, null, 7L, "กรมชลประทาน " },
                    { 58L, null, 7L, "กรมตรวจบัญชีสหกรณ์ " },
                    { 42L, null, 4L, "กรมเอเชียตะวันออก " },
                    { 43L, null, 4L, "กรมเอเชียใต้ ตะวันออกกลางและแอฟริกา " },
                    { 44L, null, 4L, "กรมการกงสุล " },
                    { 45L, null, 4L, "กรมความร่วมมือระหว่างประเทศ " },
                    { 46L, null, 5L, "สำนักงานปลัดกระทรวงกระทรวงการท่องเที่ยวและกีฬา" },
                    { 47L, null, 5L, "กรมการท่องเที่ยว" },
                    { 48L, null, 5L, "กรมพลศึกษา" },
                    { 3L, null, 1L, "สำนักงบประมาณ" },
                    { 50L, null, 6L, "สำนักงานปลัดกระทรวงกระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์" },
                    { 51L, null, 6L, "กรมพัฒนาสังคมและสวัสดิการ" },
                    { 52L, null, 6L, "กรมกิจการสตรีและสถาบันครอบครัว" },
                    { 53L, null, 6L, "กรมกิจการเด็กและเยาวชน" },
                    { 54L, null, 6L, "กรมกิจการผู้สูงอายุ" },
                    { 55L, null, 6L, "กรมส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ" },
                    { 56L, null, 7L, "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์" },
                    { 49L, null, 5L, "มหาวิทยาลัยการกีฬาแห่งชาติ" }
                });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 1L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร ที่ 313/2562 ลงวันที่ 28 ตุลาคม 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 2L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร. ที่ 102/2562 ลงวันที่ 10 พฤษภาคม 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 3L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร. ที่ 5/2562 ลงวันที่ 7 มกราคม 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 4L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "พลเอก ชัยวัฒน์ โฆสิตาภา (เขตส่วนกลาง), นางสาวสุรุ่งลักษณ์ เมฆะอำนวยชัย (เขต1,12), นางสุมิตรา อติศัพท์ (เขต2,14.17), นายณรงค์ เชื้อบุญช่วย (เขต3,9), นายพีระ ทองโพธิ์ (เขต4,18), นายธสรณ์อัฑฒ์ ธนิทธิพันธ์ (เขต5,7,10), นางสาวปภัสมน อัมราลิขิต (เขต6,16), นายจิรายุ นันท์ธราธร (เขต8,13), นางสาวอรนุช ศรีนนท์ (เขต11,15)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง สปน. ที่ 262/2561 ลงวันที่ 16 ตุลาคม 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 5L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขตส่วนกลาง,2,3),นายณรงค์ เชื้อบุญช่วย(เขต1,4,7),นางสาวปภัสมน อัมราลิขิต(เขต5,6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นายกรีฑา สพโชค(เขต13,14),นางดวงตา ตันโช(เขต15,16),นายพีระ ทองโพธิ์(เขต15,16,17,18)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร. ที่ 255/2561 ลงวันที่ 5 ตุลาคม 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 6L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขตส่วนกลาง,2,3),นายณรงค์ เชื้อบุญช่วย(เขต1,4,7),นางสาวปภัสมน อัมราลิขิต(เขต5,6),นายจิรายุ นันท์ธราธร(เขต8,9),นางสาวอรนุช ศรีนนท์(เขต10,11),นายกรีฑา สพโชค(เขต13,14), นายพีระ ทองโพธิ์(เขต15,16,17,18)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร. ที่ 206/2561 ลงวันที่ 24 สิงหาคม 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 7L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,5),นายนริสชัย ป้อมเสือ(เขต2),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายณรงค์ เชื้อบุญช่วย(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร. ที่ 100/2561 ลงวันที่ 27 เมษายน 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 8L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,5),นายนริสชัย ป้อมเสือ(เขต2),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร. ที่ 76/2561 ลงวันที่ 2 เมษายน 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 9L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2,5),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6,7),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10,11),นายศักดิ์ สมบุญโต(เขต12), นายกรีฑา สพโชค(เขต13), นายสุรศักดิ์ เรียงเครือ(เขต15,16,17,18)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", "คำสั่ง นร. ที่ 76/2561 ลงวันที่ 2 เมษายน 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 10L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),นางสาวปภัสมน อัมราลิขิต(เขต1,6,7),นายสุรศักดิ์ เรียงเครือ(เขต2,15,16),นายโชคชัย เดชอมรธัญ(เขต4),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต5, 17, 18),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10, 11, 13),นายศักดิ์ สมบุญโต(เขต12)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง นร. ที่ 336/2560 ลงวันที่ 13 ธันวาคม 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 11L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,3,9,14),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2,5),นายโชคชัย เดชอมรธัญ(เขต4),นางสาวปภัสมน อัมราลิขิต(เขต6, 7, 18),นายพศิน โกมลวิชญ์(เขต8),นางสาวอรนุช ศรีนนท์(เขต10, 11, 13),นายศักดิ์ สมบุญโต(เขต12),นายสุรศักดิ์ เรียงเครือ(เขต15, 16, 17)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง นร. ที่ 306/2560 ลงวันที่ 20 พฤศจิกายน 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 12L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางสาวปภัสมน อัมราลิขิต(เขต6),นางประภาศรี บุญวิเศษ(เขต7,15),พ.ต.ท.พงศ์พร พรามณ์เสน่ห์(เขต8),นายอิสระ ศิริวรภา(เขต10),นางอัจจิมา จันทร์สุวานิชย์(เขต11,14),นางภัทรภร ฐิติยาภรณ์(เขต12,17),นางสาวอรนุช ศรีนนท์(เขต13),นายสุรศักดิ์ เรียงเครือ(เขต16)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง นร. ที่ 215/2560 ลงวันที่ 6 กันยายน 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 13L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางสาวปภัสมน อัมราลิขิต(เขต6),นางประภาศรี บุญวิเศษ(เขต7,15),นายสุรศักดิ์ เรียงเครือ(เขต8,16),นายอิสระ ศิริวรภา(เขต10),นางอัจจิมา จันทร์สุวานิชย์(เขต11,14),นางภัทรภร ฐิติยาภรณ์(เขต12,17),นางสาวอรนุช ศรีนนท์(เขต13)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง นร. ที่ 100/2560 ลงวันที่ 28 มีนาคม 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 14L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "ผู้ตรวจราชการสำนักนายกรัฐมนตรี", "นายจิรายุ นันท์ธราธร(เขตส่วนกลาง,6,18),พันตำรวจโท เธียรรัตน์ วิเชียรสรรค์(เขต1,2),นายไพโรจน์ อาจรักษา(เขต3,4),นายวรพันธ์ เย็นทรัพย์(เขต5,9),นางประภาศรี บุญวิเศษ(เขต7, 15),นายสุรศักดิ์ เรียงเครือ(เขต8, 16),นายอิสระ ศิริวรภา(เขต10, 13),นางอัจจิมา จันทร์สุวานิชย์(เขต11, 14),นางภัทรภร ฐิติยาภรณ์(เขต12, 17)", "มอบหมายผู้ตรวจราชการสำนักนายกรัฐมนตรีรับผิดชอบเขตตรวจราชการ", " คำสั่ง นร.ที่ 3 / 2560 ลงวันที่ 5 มกราคม 2560" });

            migrationBuilder.UpdateData(
                table: "Ministries",
                keyColumn: "Id",
                keyValue: 2L,
                column: "Name",
                value: "ศึกษาธิการ");

            migrationBuilder.InsertData(
                table: "ProvincialDepartments",
                columns: new[] { "Id", "CreatedAt", "DepartmentId", "Name" },
                values: new object[] { 1L, null, 1L, "สำนักงานประชาสัมพันธ์" });

            migrationBuilder.InsertData(
                table: "ProvincialDepartmentProvince",
                columns: new[] { "ProvincialDepartmentID", "ProvinceId", "Id" },
                values: new object[,]
                {
                    { 1L, 26L, 25L },
                    { 1L, 49L, 48L },
                    { 1L, 48L, 47L },
                    { 1L, 47L, 46L },
                    { 1L, 46L, 45L },
                    { 1L, 45L, 44L },
                    { 1L, 44L, 43L },
                    { 1L, 43L, 42L },
                    { 1L, 42L, 41L },
                    { 1L, 41L, 40L },
                    { 1L, 40L, 39L },
                    { 1L, 50L, 49L },
                    { 1L, 39L, 38L },
                    { 1L, 37L, 36L },
                    { 1L, 36L, 35L },
                    { 1L, 35L, 34L },
                    { 1L, 34L, 33L },
                    { 1L, 33L, 32L },
                    { 1L, 32L, 31L },
                    { 1L, 31L, 30L },
                    { 1L, 30L, 29L },
                    { 1L, 29L, 28L },
                    { 1L, 28L, 27L },
                    { 1L, 38L, 37L },
                    { 1L, 27L, 26L },
                    { 1L, 51L, 50L },
                    { 1L, 53L, 52L },
                    { 1L, 75L, 74L },
                    { 1L, 74L, 73L },
                    { 1L, 73L, 72L },
                    { 1L, 72L, 71L },
                    { 1L, 71L, 70L },
                    { 1L, 70L, 69L },
                    { 1L, 69L, 68L },
                    { 1L, 68L, 67L },
                    { 1L, 67L, 66L },
                    { 1L, 66L, 65L },
                    { 1L, 52L, 51L },
                    { 1L, 65L, 64L },
                    { 1L, 63L, 62L },
                    { 1L, 62L, 61L },
                    { 1L, 61L, 60L },
                    { 1L, 60L, 59L },
                    { 1L, 59L, 58L },
                    { 1L, 58L, 57L },
                    { 1L, 57L, 56L },
                    { 1L, 56L, 55L },
                    { 1L, 55L, 54L },
                    { 1L, 54L, 53L },
                    { 1L, 64L, 63L },
                    { 1L, 76L, 75L },
                    { 1L, 77L, 76L },
                    { 1L, 24L, 23L },
                    { 1L, 25L, 24L },
                    { 1L, 2L, 1L },
                    { 1L, 3L, 2L },
                    { 1L, 4L, 3L },
                    { 1L, 5L, 4L },
                    { 1L, 6L, 5L },
                    { 1L, 8L, 7L },
                    { 1L, 9L, 8L },
                    { 1L, 10L, 9L },
                    { 1L, 11L, 10L },
                    { 1L, 12L, 11L },
                    { 1L, 7L, 6L },
                    { 1L, 14L, 13L },
                    { 1L, 15L, 14L },
                    { 1L, 16L, 15L },
                    { 1L, 17L, 16L },
                    { 1L, 18L, 17L },
                    { 1L, 19L, 18L },
                    { 1L, 20L, 19L },
                    { 1L, 21L, 20L },
                    { 1L, 22L, 21L },
                    { 1L, 13L, 12L },
                    { 1L, 23L, 22L }
                });

            migrationBuilder.InsertData(
                table: "ProvincialDepartments",
                columns: new[] { "Id", "CreatedAt", "DepartmentId", "Name" },
                values: new object[,]
                {
                    { 12L, null, 102L, "สำนักงานจังหวัด" },
                    { 10L, null, 91L, "สถานีอุตุนิยมวิทยา" },
                    { 9L, null, 90L, "สำนักงานสถิติจังหวัด" },
                    { 11L, null, 79L, "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด" },
                    { 8L, null, 73L, "สำนักงานขนส่งจังหวัด" },
                    { 4L, null, 50L, "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัด " },
                    { 6L, null, 59L, "สำนักงานประมงจังหวัด" },
                    { 5L, null, 56L, "สำนักงานเกษตรและสหกรณ์จังหวัด" },
                    { 3L, null, 46L, "สำนักงานท่องเที่ยวและกีฬาจังหวัด" },
                    { 13L, null, 103L, "ที่ทำการปกครองจังหวัด" },
                    { 7L, null, 60L, "สำนักงานปศุสัตว์จังหวัด " },
                    { 14L, null, 104L, "สำนักงานพัฒนาชุมชนจังหวัด" },
                    { 26L, null, 121L, "สำนักงานวัฒนธรรมจังหวัด" },
                    { 16L, null, 106L, "สำนักงานที่ดินจังหวัด" },
                    { 17L, null, 107L, "สำนักงานโยธาธิการและผังเมืองจังหวัด" },
                    { 18L, null, 108L, "สำนักงานป้องกันและบรรเทาสาธารณภัยจังหวัด" },
                    { 19L, null, 110L, "สำนักงานคุมประพฤติจังหวัด" },
                    { 20L, null, 111L, "เรือนจำ" },
                    { 21L, null, 112L, "สำนักงานบังคับคดีจังหวัด" },
                    { 22L, null, 116L, "สำนักงานแรงงานจังหวัด" },
                    { 23L, null, 117L, "สำนักงานจัดหางานจังหวัด" },
                    { 24L, null, 118L, "สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัด" },
                    { 25L, null, 119L, "สำนักงานประกันสังคมจังหวัด" },
                    { 27L, null, 133L, "สำนักงานสาธารณสุขจังหวัด" },
                    { 28L, null, 142L, "สำนักงานอุตสาหกรรมจังหวัด" },
                    { 15L, null, 105L, "สำนักงานส่งเสริมการปกครองท้องถิ่นจังหวัด" },
                    { 2L, null, 24L, "สำนักงานคลังจังหวัด" }
                });

            migrationBuilder.InsertData(
                table: "ProvincialDepartmentProvince",
                columns: new[] { "ProvincialDepartmentID", "ProvinceId", "Id" },
                values: new object[,]
                {
                    { 2L, 2L, 77L },
                    { 21L, 7L, 1299L },
                    { 21L, 6L, 1298L },
                    { 21L, 5L, 1297L },
                    { 21L, 4L, 1296L },
                    { 21L, 3L, 1295L },
                    { 21L, 2L, 1294L },
                    { 20L, 77L, 1293L },
                    { 20L, 76L, 1292L },
                    { 20L, 75L, 1291L },
                    { 20L, 74L, 1290L },
                    { 20L, 73L, 1289L },
                    { 21L, 8L, 1300L },
                    { 20L, 72L, 1288L },
                    { 20L, 70L, 1286L },
                    { 20L, 69L, 1285L },
                    { 20L, 68L, 1284L },
                    { 20L, 67L, 1283L },
                    { 20L, 66L, 1282L },
                    { 20L, 65L, 1281L },
                    { 20L, 64L, 1280L },
                    { 20L, 63L, 1279L },
                    { 20L, 62L, 1278L },
                    { 20L, 61L, 1277L },
                    { 20L, 60L, 1276L },
                    { 20L, 71L, 1287L },
                    { 21L, 9L, 1301L },
                    { 21L, 10L, 1302L },
                    { 21L, 11L, 1303L },
                    { 21L, 36L, 1328L },
                    { 21L, 35L, 1327L },
                    { 21L, 34L, 1326L },
                    { 21L, 33L, 1325L },
                    { 21L, 32L, 1324L },
                    { 21L, 31L, 1323L },
                    { 21L, 30L, 1322L },
                    { 21L, 29L, 1321L },
                    { 21L, 28L, 1320L },
                    { 21L, 27L, 1319L },
                    { 21L, 26L, 1318L },
                    { 21L, 25L, 1317L },
                    { 21L, 24L, 1316L },
                    { 21L, 23L, 1315L },
                    { 21L, 22L, 1314L },
                    { 21L, 21L, 1313L },
                    { 21L, 20L, 1312L },
                    { 21L, 19L, 1311L },
                    { 21L, 18L, 1310L },
                    { 21L, 17L, 1309L },
                    { 21L, 16L, 1308L },
                    { 21L, 15L, 1307L },
                    { 21L, 14L, 1306L },
                    { 21L, 13L, 1305L },
                    { 21L, 12L, 1304L },
                    { 20L, 59L, 1275L },
                    { 21L, 37L, 1329L },
                    { 20L, 58L, 1274L },
                    { 20L, 56L, 1272L },
                    { 20L, 26L, 1242L },
                    { 20L, 25L, 1241L },
                    { 20L, 24L, 1240L },
                    { 20L, 23L, 1239L },
                    { 20L, 22L, 1238L },
                    { 20L, 21L, 1237L },
                    { 20L, 20L, 1236L },
                    { 20L, 19L, 1235L },
                    { 20L, 18L, 1234L },
                    { 20L, 17L, 1233L },
                    { 20L, 16L, 1232L },
                    { 20L, 27L, 1243L },
                    { 20L, 15L, 1231L },
                    { 20L, 13L, 1229L },
                    { 20L, 12L, 1228L },
                    { 20L, 11L, 1227L },
                    { 20L, 10L, 1226L },
                    { 20L, 9L, 1225L },
                    { 20L, 8L, 1224L },
                    { 20L, 7L, 1223L },
                    { 20L, 6L, 1222L },
                    { 20L, 5L, 1221L },
                    { 20L, 4L, 1220L },
                    { 20L, 3L, 1219L },
                    { 20L, 14L, 1230L },
                    { 20L, 28L, 1244L },
                    { 20L, 29L, 1245L },
                    { 20L, 30L, 1246L },
                    { 20L, 55L, 1271L },
                    { 20L, 54L, 1270L },
                    { 20L, 53L, 1269L },
                    { 20L, 52L, 1268L },
                    { 20L, 51L, 1267L },
                    { 20L, 50L, 1266L },
                    { 20L, 49L, 1265L },
                    { 20L, 48L, 1264L },
                    { 20L, 47L, 1263L },
                    { 20L, 46L, 1262L },
                    { 20L, 45L, 1261L },
                    { 20L, 44L, 1260L },
                    { 20L, 43L, 1259L },
                    { 20L, 42L, 1258L },
                    { 20L, 41L, 1257L },
                    { 20L, 40L, 1256L },
                    { 20L, 39L, 1255L },
                    { 20L, 38L, 1254L },
                    { 20L, 37L, 1253L },
                    { 20L, 36L, 1252L },
                    { 20L, 35L, 1251L },
                    { 20L, 34L, 1250L },
                    { 20L, 33L, 1249L },
                    { 20L, 32L, 1248L },
                    { 20L, 31L, 1247L },
                    { 20L, 57L, 1273L },
                    { 20L, 2L, 1218L },
                    { 21L, 38L, 1330L },
                    { 21L, 40L, 1332L },
                    { 22L, 45L, 1413L },
                    { 22L, 44L, 1412L },
                    { 22L, 43L, 1411L },
                    { 22L, 42L, 1410L },
                    { 22L, 41L, 1409L },
                    { 22L, 40L, 1408L },
                    { 22L, 39L, 1407L },
                    { 22L, 38L, 1406L },
                    { 22L, 37L, 1405L },
                    { 22L, 36L, 1404L },
                    { 22L, 35L, 1403L },
                    { 22L, 46L, 1414L },
                    { 22L, 34L, 1402L },
                    { 22L, 32L, 1400L },
                    { 22L, 31L, 1399L },
                    { 22L, 30L, 1398L },
                    { 22L, 29L, 1397L },
                    { 22L, 28L, 1396L },
                    { 22L, 27L, 1395L },
                    { 22L, 26L, 1394L },
                    { 22L, 25L, 1393L },
                    { 22L, 24L, 1392L },
                    { 22L, 23L, 1391L },
                    { 22L, 22L, 1390L },
                    { 22L, 33L, 1401L },
                    { 22L, 47L, 1415L },
                    { 22L, 48L, 1416L },
                    { 22L, 49L, 1417L },
                    { 22L, 74L, 1442L },
                    { 22L, 73L, 1441L },
                    { 22L, 72L, 1440L },
                    { 22L, 71L, 1439L },
                    { 22L, 70L, 1438L },
                    { 22L, 69L, 1437L },
                    { 22L, 68L, 1436L },
                    { 22L, 67L, 1435L },
                    { 22L, 66L, 1434L },
                    { 22L, 65L, 1433L },
                    { 22L, 64L, 1432L },
                    { 22L, 63L, 1431L },
                    { 22L, 62L, 1430L },
                    { 22L, 61L, 1429L },
                    { 22L, 60L, 1428L },
                    { 22L, 59L, 1427L },
                    { 22L, 58L, 1426L },
                    { 22L, 57L, 1425L },
                    { 22L, 56L, 1424L },
                    { 22L, 55L, 1423L },
                    { 22L, 54L, 1422L },
                    { 22L, 53L, 1421L },
                    { 22L, 52L, 1420L },
                    { 22L, 51L, 1419L },
                    { 22L, 50L, 1418L },
                    { 22L, 21L, 1389L },
                    { 21L, 39L, 1331L },
                    { 22L, 20L, 1388L },
                    { 22L, 18L, 1386L },
                    { 21L, 64L, 1356L },
                    { 21L, 63L, 1355L },
                    { 21L, 62L, 1354L },
                    { 21L, 61L, 1353L },
                    { 21L, 60L, 1352L },
                    { 21L, 59L, 1351L },
                    { 21L, 58L, 1350L },
                    { 21L, 57L, 1349L },
                    { 21L, 56L, 1348L },
                    { 21L, 55L, 1347L },
                    { 21L, 54L, 1346L },
                    { 21L, 65L, 1357L },
                    { 21L, 53L, 1345L },
                    { 21L, 51L, 1343L },
                    { 21L, 50L, 1342L },
                    { 21L, 49L, 1341L },
                    { 21L, 48L, 1340L },
                    { 21L, 47L, 1339L },
                    { 21L, 46L, 1338L },
                    { 21L, 45L, 1337L },
                    { 21L, 44L, 1336L },
                    { 21L, 43L, 1335L },
                    { 21L, 42L, 1334L },
                    { 21L, 41L, 1333L },
                    { 21L, 52L, 1344L },
                    { 21L, 66L, 1358L },
                    { 21L, 67L, 1359L },
                    { 21L, 68L, 1360L },
                    { 22L, 17L, 1385L },
                    { 22L, 16L, 1384L },
                    { 22L, 15L, 1383L },
                    { 22L, 14L, 1382L },
                    { 22L, 13L, 1381L },
                    { 22L, 12L, 1380L },
                    { 22L, 11L, 1379L },
                    { 22L, 10L, 1378L },
                    { 22L, 9L, 1377L },
                    { 22L, 8L, 1376L },
                    { 22L, 7L, 1375L },
                    { 22L, 6L, 1374L },
                    { 22L, 5L, 1373L },
                    { 22L, 4L, 1372L },
                    { 22L, 3L, 1371L },
                    { 22L, 2L, 1370L },
                    { 21L, 77L, 1369L },
                    { 21L, 76L, 1368L },
                    { 21L, 75L, 1367L },
                    { 21L, 74L, 1366L },
                    { 21L, 73L, 1365L },
                    { 21L, 72L, 1364L },
                    { 21L, 71L, 1363L },
                    { 21L, 70L, 1362L },
                    { 21L, 69L, 1361L },
                    { 22L, 19L, 1387L },
                    { 22L, 75L, 1443L },
                    { 19L, 77L, 1217L },
                    { 19L, 75L, 1215L },
                    { 18L, 7L, 1071L },
                    { 18L, 6L, 1070L },
                    { 18L, 5L, 1069L },
                    { 18L, 4L, 1068L },
                    { 18L, 3L, 1067L },
                    { 18L, 2L, 1066L },
                    { 17L, 77L, 1065L },
                    { 17L, 76L, 1064L },
                    { 17L, 75L, 1063L },
                    { 17L, 74L, 1062L },
                    { 17L, 73L, 1061L },
                    { 18L, 8L, 1072L },
                    { 17L, 72L, 1060L },
                    { 17L, 70L, 1058L },
                    { 17L, 69L, 1057L },
                    { 17L, 68L, 1056L },
                    { 17L, 67L, 1055L },
                    { 17L, 66L, 1054L },
                    { 17L, 65L, 1053L },
                    { 17L, 64L, 1052L },
                    { 17L, 63L, 1051L },
                    { 17L, 62L, 1050L },
                    { 17L, 61L, 1049L },
                    { 17L, 60L, 1048L },
                    { 17L, 71L, 1059L },
                    { 18L, 9L, 1073L },
                    { 18L, 10L, 1074L },
                    { 18L, 11L, 1075L },
                    { 18L, 36L, 1100L },
                    { 18L, 35L, 1099L },
                    { 18L, 34L, 1098L },
                    { 18L, 33L, 1097L },
                    { 18L, 32L, 1096L },
                    { 18L, 31L, 1095L },
                    { 18L, 30L, 1094L },
                    { 18L, 29L, 1093L },
                    { 18L, 28L, 1092L },
                    { 18L, 27L, 1091L },
                    { 18L, 26L, 1090L },
                    { 18L, 25L, 1089L },
                    { 18L, 24L, 1088L },
                    { 18L, 23L, 1087L },
                    { 18L, 22L, 1086L },
                    { 18L, 21L, 1085L },
                    { 18L, 20L, 1084L },
                    { 18L, 19L, 1083L },
                    { 18L, 18L, 1082L },
                    { 18L, 17L, 1081L },
                    { 18L, 16L, 1080L },
                    { 18L, 15L, 1079L },
                    { 18L, 14L, 1078L },
                    { 18L, 13L, 1077L },
                    { 18L, 12L, 1076L },
                    { 17L, 59L, 1047L },
                    { 18L, 37L, 1101L },
                    { 17L, 58L, 1046L },
                    { 17L, 56L, 1044L },
                    { 17L, 26L, 1014L },
                    { 17L, 25L, 1013L },
                    { 17L, 24L, 1012L },
                    { 17L, 23L, 1011L },
                    { 17L, 22L, 1010L },
                    { 17L, 21L, 1009L },
                    { 17L, 20L, 1008L },
                    { 17L, 19L, 1007L },
                    { 17L, 18L, 1006L },
                    { 17L, 17L, 1005L },
                    { 17L, 16L, 1004L },
                    { 17L, 27L, 1015L },
                    { 17L, 15L, 1003L },
                    { 17L, 13L, 1001L },
                    { 17L, 12L, 1000L },
                    { 17L, 11L, 999L },
                    { 17L, 10L, 998L },
                    { 17L, 9L, 997L },
                    { 17L, 8L, 996L },
                    { 17L, 7L, 995L },
                    { 17L, 6L, 994L },
                    { 17L, 5L, 993L },
                    { 17L, 4L, 992L },
                    { 17L, 3L, 991L },
                    { 17L, 14L, 1002L },
                    { 17L, 28L, 1016L },
                    { 17L, 29L, 1017L },
                    { 17L, 30L, 1018L },
                    { 17L, 55L, 1043L },
                    { 17L, 54L, 1042L },
                    { 17L, 53L, 1041L },
                    { 17L, 52L, 1040L },
                    { 17L, 51L, 1039L },
                    { 17L, 50L, 1038L },
                    { 17L, 49L, 1037L },
                    { 17L, 48L, 1036L },
                    { 17L, 47L, 1035L },
                    { 17L, 46L, 1034L },
                    { 17L, 45L, 1033L },
                    { 17L, 44L, 1032L },
                    { 17L, 43L, 1031L },
                    { 17L, 42L, 1030L },
                    { 17L, 41L, 1029L },
                    { 17L, 40L, 1028L },
                    { 17L, 39L, 1027L },
                    { 17L, 38L, 1026L },
                    { 17L, 37L, 1025L },
                    { 17L, 36L, 1024L },
                    { 17L, 35L, 1023L },
                    { 17L, 34L, 1022L },
                    { 17L, 33L, 1021L },
                    { 17L, 32L, 1020L },
                    { 17L, 31L, 1019L },
                    { 17L, 57L, 1045L },
                    { 19L, 76L, 1216L },
                    { 18L, 38L, 1102L },
                    { 18L, 40L, 1104L },
                    { 19L, 45L, 1185L },
                    { 19L, 44L, 1184L },
                    { 19L, 43L, 1183L },
                    { 19L, 42L, 1182L },
                    { 19L, 41L, 1181L },
                    { 19L, 40L, 1180L },
                    { 19L, 39L, 1179L },
                    { 19L, 38L, 1178L },
                    { 19L, 37L, 1177L },
                    { 19L, 36L, 1176L },
                    { 19L, 35L, 1175L },
                    { 19L, 46L, 1186L },
                    { 19L, 34L, 1174L },
                    { 19L, 32L, 1172L },
                    { 19L, 31L, 1171L },
                    { 19L, 30L, 1170L },
                    { 19L, 29L, 1169L },
                    { 19L, 28L, 1168L },
                    { 19L, 27L, 1167L },
                    { 19L, 26L, 1166L },
                    { 19L, 25L, 1165L },
                    { 19L, 24L, 1164L },
                    { 19L, 23L, 1163L },
                    { 19L, 22L, 1162L },
                    { 19L, 33L, 1173L },
                    { 19L, 47L, 1187L },
                    { 19L, 48L, 1188L },
                    { 19L, 49L, 1189L },
                    { 19L, 74L, 1214L },
                    { 19L, 73L, 1213L },
                    { 19L, 72L, 1212L },
                    { 19L, 71L, 1211L },
                    { 19L, 70L, 1210L },
                    { 19L, 69L, 1209L },
                    { 19L, 68L, 1208L },
                    { 19L, 67L, 1207L },
                    { 19L, 66L, 1206L },
                    { 19L, 65L, 1205L },
                    { 19L, 64L, 1204L },
                    { 19L, 63L, 1203L },
                    { 19L, 62L, 1202L },
                    { 19L, 61L, 1201L },
                    { 19L, 60L, 1200L },
                    { 19L, 59L, 1199L },
                    { 19L, 58L, 1198L },
                    { 19L, 57L, 1197L },
                    { 19L, 56L, 1196L },
                    { 19L, 55L, 1195L },
                    { 19L, 54L, 1194L },
                    { 19L, 53L, 1193L },
                    { 19L, 52L, 1192L },
                    { 19L, 51L, 1191L },
                    { 19L, 50L, 1190L },
                    { 19L, 21L, 1161L },
                    { 18L, 39L, 1103L },
                    { 19L, 20L, 1160L },
                    { 19L, 18L, 1158L },
                    { 18L, 64L, 1128L },
                    { 18L, 63L, 1127L },
                    { 18L, 62L, 1126L },
                    { 18L, 61L, 1125L },
                    { 18L, 60L, 1124L },
                    { 18L, 59L, 1123L },
                    { 18L, 58L, 1122L },
                    { 18L, 57L, 1121L },
                    { 18L, 56L, 1120L },
                    { 18L, 55L, 1119L },
                    { 18L, 54L, 1118L },
                    { 18L, 65L, 1129L },
                    { 18L, 53L, 1117L },
                    { 18L, 51L, 1115L },
                    { 18L, 50L, 1114L },
                    { 18L, 49L, 1113L },
                    { 18L, 48L, 1112L },
                    { 18L, 47L, 1111L },
                    { 18L, 46L, 1110L },
                    { 18L, 45L, 1109L },
                    { 18L, 44L, 1108L },
                    { 18L, 43L, 1107L },
                    { 18L, 42L, 1106L },
                    { 18L, 41L, 1105L },
                    { 18L, 52L, 1116L },
                    { 18L, 66L, 1130L },
                    { 18L, 67L, 1131L },
                    { 18L, 68L, 1132L },
                    { 19L, 17L, 1157L },
                    { 19L, 16L, 1156L },
                    { 19L, 15L, 1155L },
                    { 19L, 14L, 1154L },
                    { 19L, 13L, 1153L },
                    { 19L, 12L, 1152L },
                    { 19L, 11L, 1151L },
                    { 19L, 10L, 1150L },
                    { 19L, 9L, 1149L },
                    { 19L, 8L, 1148L },
                    { 19L, 7L, 1147L },
                    { 19L, 6L, 1146L },
                    { 19L, 5L, 1145L },
                    { 19L, 4L, 1144L },
                    { 19L, 3L, 1143L },
                    { 19L, 2L, 1142L },
                    { 18L, 77L, 1141L },
                    { 18L, 76L, 1140L },
                    { 18L, 75L, 1139L },
                    { 18L, 74L, 1138L },
                    { 18L, 73L, 1137L },
                    { 18L, 72L, 1136L },
                    { 18L, 71L, 1135L },
                    { 18L, 70L, 1134L },
                    { 18L, 69L, 1133L },
                    { 19L, 19L, 1159L },
                    { 22L, 76L, 1444L },
                    { 22L, 77L, 1445L },
                    { 23L, 2L, 1446L },
                    { 27L, 8L, 1756L },
                    { 27L, 7L, 1755L },
                    { 27L, 6L, 1754L },
                    { 27L, 5L, 1753L },
                    { 27L, 4L, 1752L },
                    { 27L, 3L, 1751L },
                    { 27L, 2L, 1750L },
                    { 26L, 77L, 1749L },
                    { 26L, 76L, 1748L },
                    { 26L, 75L, 1747L },
                    { 26L, 74L, 1746L },
                    { 27L, 9L, 1757L },
                    { 26L, 73L, 1745L },
                    { 26L, 71L, 1743L },
                    { 26L, 70L, 1742L },
                    { 26L, 69L, 1741L },
                    { 26L, 68L, 1740L },
                    { 26L, 67L, 1739L },
                    { 26L, 66L, 1738L },
                    { 26L, 65L, 1737L },
                    { 26L, 64L, 1736L },
                    { 26L, 63L, 1735L },
                    { 26L, 62L, 1734L },
                    { 26L, 61L, 1733L },
                    { 26L, 72L, 1744L },
                    { 27L, 10L, 1758L },
                    { 27L, 11L, 1759L },
                    { 27L, 12L, 1760L },
                    { 27L, 37L, 1785L },
                    { 27L, 36L, 1784L },
                    { 27L, 35L, 1783L },
                    { 27L, 34L, 1782L },
                    { 27L, 33L, 1781L },
                    { 27L, 32L, 1780L },
                    { 27L, 31L, 1779L },
                    { 27L, 30L, 1778L },
                    { 27L, 29L, 1777L },
                    { 27L, 28L, 1776L },
                    { 27L, 27L, 1775L },
                    { 27L, 26L, 1774L },
                    { 27L, 25L, 1773L },
                    { 27L, 24L, 1772L },
                    { 27L, 23L, 1771L },
                    { 27L, 22L, 1770L },
                    { 27L, 21L, 1769L },
                    { 27L, 20L, 1768L },
                    { 27L, 19L, 1767L },
                    { 27L, 18L, 1766L },
                    { 27L, 17L, 1765L },
                    { 27L, 16L, 1764L },
                    { 27L, 15L, 1763L },
                    { 27L, 14L, 1762L },
                    { 27L, 13L, 1761L },
                    { 26L, 60L, 1732L },
                    { 27L, 38L, 1786L },
                    { 26L, 59L, 1731L },
                    { 26L, 57L, 1729L },
                    { 26L, 27L, 1699L },
                    { 26L, 26L, 1698L },
                    { 26L, 25L, 1697L },
                    { 26L, 24L, 1696L },
                    { 26L, 23L, 1695L },
                    { 26L, 22L, 1694L },
                    { 26L, 21L, 1693L },
                    { 26L, 20L, 1692L },
                    { 26L, 19L, 1691L },
                    { 26L, 18L, 1690L },
                    { 26L, 17L, 1689L },
                    { 26L, 28L, 1700L },
                    { 26L, 16L, 1688L },
                    { 26L, 14L, 1686L },
                    { 26L, 13L, 1685L },
                    { 26L, 12L, 1684L },
                    { 26L, 11L, 1683L },
                    { 26L, 10L, 1682L },
                    { 26L, 9L, 1681L },
                    { 26L, 8L, 1680L },
                    { 26L, 7L, 1679L },
                    { 26L, 6L, 1678L },
                    { 26L, 5L, 1677L },
                    { 26L, 4L, 1676L },
                    { 26L, 15L, 1687L },
                    { 26L, 29L, 1701L },
                    { 26L, 30L, 1702L },
                    { 26L, 31L, 1703L },
                    { 26L, 56L, 1728L },
                    { 26L, 55L, 1727L },
                    { 26L, 54L, 1726L },
                    { 26L, 53L, 1725L },
                    { 26L, 52L, 1724L },
                    { 26L, 51L, 1723L },
                    { 26L, 50L, 1722L },
                    { 26L, 49L, 1721L },
                    { 26L, 48L, 1720L },
                    { 26L, 47L, 1719L },
                    { 26L, 46L, 1718L },
                    { 26L, 45L, 1717L },
                    { 26L, 44L, 1716L },
                    { 26L, 43L, 1715L },
                    { 26L, 42L, 1714L },
                    { 26L, 41L, 1713L },
                    { 26L, 40L, 1712L },
                    { 26L, 39L, 1711L },
                    { 26L, 38L, 1710L },
                    { 26L, 37L, 1709L },
                    { 26L, 36L, 1708L },
                    { 26L, 35L, 1707L },
                    { 26L, 34L, 1706L },
                    { 26L, 33L, 1705L },
                    { 26L, 32L, 1704L },
                    { 26L, 58L, 1730L },
                    { 26L, 3L, 1675L },
                    { 27L, 39L, 1787L },
                    { 27L, 41L, 1789L },
                    { 28L, 46L, 1870L },
                    { 28L, 45L, 1869L },
                    { 28L, 44L, 1868L },
                    { 28L, 43L, 1867L },
                    { 28L, 42L, 1866L },
                    { 28L, 41L, 1865L },
                    { 28L, 40L, 1864L },
                    { 28L, 39L, 1863L },
                    { 28L, 38L, 1862L },
                    { 28L, 37L, 1861L },
                    { 28L, 36L, 1860L },
                    { 28L, 47L, 1871L },
                    { 28L, 35L, 1859L },
                    { 28L, 33L, 1857L },
                    { 28L, 32L, 1856L },
                    { 28L, 31L, 1855L },
                    { 28L, 30L, 1854L },
                    { 28L, 29L, 1853L },
                    { 28L, 28L, 1852L },
                    { 28L, 27L, 1851L },
                    { 28L, 26L, 1850L },
                    { 28L, 25L, 1849L },
                    { 28L, 24L, 1848L },
                    { 28L, 23L, 1847L },
                    { 28L, 34L, 1858L },
                    { 28L, 48L, 1872L },
                    { 28L, 49L, 1873L },
                    { 28L, 50L, 1874L },
                    { 28L, 75L, 1899L },
                    { 28L, 74L, 1898L },
                    { 28L, 73L, 1897L },
                    { 28L, 72L, 1896L },
                    { 28L, 71L, 1895L },
                    { 28L, 70L, 1894L },
                    { 28L, 69L, 1893L },
                    { 28L, 68L, 1892L },
                    { 28L, 67L, 1891L },
                    { 28L, 66L, 1890L },
                    { 28L, 65L, 1889L },
                    { 28L, 64L, 1888L },
                    { 28L, 63L, 1887L },
                    { 28L, 62L, 1886L },
                    { 28L, 61L, 1885L },
                    { 28L, 60L, 1884L },
                    { 28L, 59L, 1883L },
                    { 28L, 58L, 1882L },
                    { 28L, 57L, 1881L },
                    { 28L, 56L, 1880L },
                    { 28L, 55L, 1879L },
                    { 28L, 54L, 1878L },
                    { 28L, 53L, 1877L },
                    { 28L, 52L, 1876L },
                    { 28L, 51L, 1875L },
                    { 28L, 22L, 1846L },
                    { 27L, 40L, 1788L },
                    { 28L, 21L, 1845L },
                    { 28L, 19L, 1843L },
                    { 27L, 65L, 1813L },
                    { 27L, 64L, 1812L },
                    { 27L, 63L, 1811L },
                    { 27L, 62L, 1810L },
                    { 27L, 61L, 1809L },
                    { 27L, 60L, 1808L },
                    { 27L, 59L, 1807L },
                    { 27L, 58L, 1806L },
                    { 27L, 57L, 1805L },
                    { 27L, 56L, 1804L },
                    { 27L, 55L, 1803L },
                    { 27L, 66L, 1814L },
                    { 27L, 54L, 1802L },
                    { 27L, 52L, 1800L },
                    { 27L, 51L, 1799L },
                    { 27L, 50L, 1798L },
                    { 27L, 49L, 1797L },
                    { 27L, 48L, 1796L },
                    { 27L, 47L, 1795L },
                    { 27L, 46L, 1794L },
                    { 27L, 45L, 1793L },
                    { 27L, 44L, 1792L },
                    { 27L, 43L, 1791L },
                    { 27L, 42L, 1790L },
                    { 27L, 53L, 1801L },
                    { 27L, 67L, 1815L },
                    { 27L, 68L, 1816L },
                    { 27L, 69L, 1817L },
                    { 28L, 18L, 1842L },
                    { 28L, 17L, 1841L },
                    { 28L, 16L, 1840L },
                    { 28L, 15L, 1839L },
                    { 28L, 14L, 1838L },
                    { 28L, 13L, 1837L },
                    { 28L, 12L, 1836L },
                    { 28L, 11L, 1835L },
                    { 28L, 10L, 1834L },
                    { 28L, 9L, 1833L },
                    { 28L, 8L, 1832L },
                    { 28L, 7L, 1831L },
                    { 28L, 6L, 1830L },
                    { 28L, 5L, 1829L },
                    { 28L, 4L, 1828L },
                    { 28L, 3L, 1827L },
                    { 28L, 2L, 1826L },
                    { 27L, 77L, 1825L },
                    { 27L, 76L, 1824L },
                    { 27L, 75L, 1823L },
                    { 27L, 74L, 1822L },
                    { 27L, 73L, 1821L },
                    { 27L, 72L, 1820L },
                    { 27L, 71L, 1819L },
                    { 27L, 70L, 1818L },
                    { 28L, 20L, 1844L },
                    { 26L, 2L, 1674L },
                    { 25L, 77L, 1673L },
                    { 25L, 76L, 1672L },
                    { 24L, 7L, 1527L },
                    { 24L, 6L, 1526L },
                    { 24L, 5L, 1525L },
                    { 24L, 4L, 1524L },
                    { 24L, 3L, 1523L },
                    { 24L, 2L, 1522L },
                    { 23L, 77L, 1521L },
                    { 23L, 76L, 1520L },
                    { 23L, 75L, 1519L },
                    { 23L, 74L, 1518L },
                    { 23L, 73L, 1517L },
                    { 24L, 8L, 1528L },
                    { 23L, 72L, 1516L },
                    { 23L, 70L, 1514L }
                });

            migrationBuilder.InsertData(
                table: "ProvincialDepartmentProvince",
                columns: new[] { "ProvincialDepartmentID", "ProvinceId", "Id" },
                values: new object[,]
                {
                    { 23L, 69L, 1513L },
                    { 23L, 68L, 1512L },
                    { 23L, 67L, 1511L },
                    { 23L, 66L, 1510L },
                    { 23L, 65L, 1509L },
                    { 23L, 64L, 1508L },
                    { 23L, 63L, 1507L },
                    { 23L, 62L, 1506L },
                    { 23L, 61L, 1505L },
                    { 23L, 60L, 1504L },
                    { 23L, 71L, 1515L },
                    { 24L, 9L, 1529L },
                    { 24L, 10L, 1530L },
                    { 24L, 11L, 1531L },
                    { 24L, 36L, 1556L },
                    { 24L, 35L, 1555L },
                    { 24L, 34L, 1554L },
                    { 24L, 33L, 1553L },
                    { 24L, 32L, 1552L },
                    { 24L, 31L, 1551L },
                    { 24L, 30L, 1550L },
                    { 24L, 29L, 1549L },
                    { 24L, 28L, 1548L },
                    { 24L, 27L, 1547L },
                    { 24L, 26L, 1546L },
                    { 24L, 25L, 1545L },
                    { 24L, 24L, 1544L },
                    { 24L, 23L, 1543L },
                    { 24L, 22L, 1542L },
                    { 24L, 21L, 1541L },
                    { 24L, 20L, 1540L },
                    { 24L, 19L, 1539L },
                    { 24L, 18L, 1538L },
                    { 24L, 17L, 1537L },
                    { 24L, 16L, 1536L },
                    { 24L, 15L, 1535L },
                    { 24L, 14L, 1534L },
                    { 24L, 13L, 1533L },
                    { 24L, 12L, 1532L },
                    { 23L, 59L, 1503L },
                    { 24L, 37L, 1557L },
                    { 23L, 58L, 1502L },
                    { 23L, 56L, 1500L },
                    { 23L, 26L, 1470L },
                    { 23L, 25L, 1469L },
                    { 23L, 24L, 1468L },
                    { 23L, 23L, 1467L },
                    { 23L, 22L, 1466L },
                    { 23L, 21L, 1465L },
                    { 23L, 20L, 1464L },
                    { 23L, 19L, 1463L },
                    { 23L, 18L, 1462L },
                    { 23L, 17L, 1461L },
                    { 23L, 16L, 1460L },
                    { 23L, 27L, 1471L },
                    { 23L, 15L, 1459L },
                    { 23L, 13L, 1457L },
                    { 23L, 12L, 1456L },
                    { 23L, 11L, 1455L },
                    { 23L, 10L, 1454L },
                    { 23L, 9L, 1453L },
                    { 23L, 8L, 1452L },
                    { 23L, 7L, 1451L },
                    { 23L, 6L, 1450L },
                    { 23L, 5L, 1449L },
                    { 23L, 4L, 1448L },
                    { 23L, 3L, 1447L },
                    { 23L, 14L, 1458L },
                    { 23L, 28L, 1472L },
                    { 23L, 29L, 1473L },
                    { 23L, 30L, 1474L },
                    { 23L, 55L, 1499L },
                    { 23L, 54L, 1498L },
                    { 23L, 53L, 1497L },
                    { 23L, 52L, 1496L },
                    { 23L, 51L, 1495L },
                    { 23L, 50L, 1494L },
                    { 23L, 49L, 1493L },
                    { 23L, 48L, 1492L },
                    { 23L, 47L, 1491L },
                    { 23L, 46L, 1490L },
                    { 23L, 45L, 1489L },
                    { 23L, 44L, 1488L },
                    { 23L, 43L, 1487L },
                    { 23L, 42L, 1486L },
                    { 23L, 41L, 1485L },
                    { 23L, 40L, 1484L },
                    { 23L, 39L, 1483L },
                    { 23L, 38L, 1482L },
                    { 23L, 37L, 1481L },
                    { 23L, 36L, 1480L },
                    { 23L, 35L, 1479L },
                    { 23L, 34L, 1478L },
                    { 23L, 33L, 1477L },
                    { 23L, 32L, 1476L },
                    { 23L, 31L, 1475L },
                    { 23L, 57L, 1501L },
                    { 24L, 38L, 1558L },
                    { 24L, 39L, 1559L },
                    { 24L, 40L, 1560L },
                    { 25L, 46L, 1642L },
                    { 25L, 45L, 1641L },
                    { 25L, 44L, 1640L },
                    { 25L, 43L, 1639L },
                    { 25L, 42L, 1638L },
                    { 25L, 41L, 1637L },
                    { 25L, 40L, 1636L },
                    { 25L, 39L, 1635L },
                    { 25L, 38L, 1634L },
                    { 25L, 37L, 1633L },
                    { 25L, 36L, 1632L },
                    { 25L, 47L, 1643L },
                    { 25L, 35L, 1631L },
                    { 25L, 33L, 1629L },
                    { 25L, 32L, 1628L },
                    { 25L, 31L, 1627L },
                    { 25L, 30L, 1626L },
                    { 25L, 29L, 1625L },
                    { 25L, 28L, 1624L },
                    { 25L, 27L, 1623L },
                    { 25L, 26L, 1622L },
                    { 25L, 25L, 1621L },
                    { 25L, 24L, 1620L },
                    { 25L, 23L, 1619L },
                    { 25L, 34L, 1630L },
                    { 25L, 48L, 1644L },
                    { 25L, 49L, 1645L },
                    { 25L, 50L, 1646L },
                    { 25L, 75L, 1671L },
                    { 25L, 74L, 1670L },
                    { 25L, 73L, 1669L },
                    { 25L, 72L, 1668L },
                    { 25L, 71L, 1667L },
                    { 25L, 70L, 1666L },
                    { 25L, 69L, 1665L },
                    { 25L, 68L, 1664L },
                    { 25L, 67L, 1663L },
                    { 25L, 66L, 1662L },
                    { 25L, 65L, 1661L },
                    { 25L, 64L, 1660L },
                    { 25L, 63L, 1659L },
                    { 25L, 62L, 1658L },
                    { 25L, 61L, 1657L },
                    { 25L, 60L, 1656L },
                    { 25L, 59L, 1655L },
                    { 25L, 58L, 1654L },
                    { 25L, 57L, 1653L },
                    { 25L, 56L, 1652L },
                    { 25L, 55L, 1651L },
                    { 25L, 54L, 1650L },
                    { 25L, 53L, 1649L },
                    { 25L, 52L, 1648L },
                    { 25L, 51L, 1647L },
                    { 25L, 22L, 1618L },
                    { 25L, 21L, 1617L },
                    { 25L, 20L, 1616L },
                    { 25L, 19L, 1615L },
                    { 24L, 65L, 1585L },
                    { 24L, 64L, 1584L },
                    { 24L, 63L, 1583L },
                    { 24L, 62L, 1582L },
                    { 24L, 61L, 1581L },
                    { 24L, 60L, 1580L },
                    { 24L, 59L, 1579L },
                    { 24L, 58L, 1578L },
                    { 24L, 57L, 1577L },
                    { 24L, 56L, 1576L },
                    { 24L, 55L, 1575L },
                    { 24L, 54L, 1574L },
                    { 24L, 53L, 1573L },
                    { 24L, 52L, 1572L },
                    { 24L, 51L, 1571L },
                    { 24L, 50L, 1570L },
                    { 24L, 49L, 1569L },
                    { 24L, 48L, 1568L },
                    { 24L, 47L, 1567L },
                    { 24L, 46L, 1566L },
                    { 24L, 45L, 1565L },
                    { 24L, 44L, 1564L },
                    { 24L, 43L, 1563L },
                    { 24L, 42L, 1562L },
                    { 24L, 41L, 1561L },
                    { 24L, 66L, 1586L },
                    { 17L, 2L, 990L },
                    { 24L, 67L, 1587L },
                    { 24L, 69L, 1589L },
                    { 25L, 18L, 1614L },
                    { 25L, 17L, 1613L },
                    { 25L, 16L, 1612L },
                    { 25L, 15L, 1611L },
                    { 25L, 14L, 1610L },
                    { 25L, 13L, 1609L },
                    { 25L, 12L, 1608L },
                    { 25L, 11L, 1607L },
                    { 25L, 10L, 1606L },
                    { 25L, 9L, 1605L },
                    { 25L, 8L, 1604L },
                    { 25L, 7L, 1603L },
                    { 25L, 6L, 1602L },
                    { 25L, 5L, 1601L },
                    { 25L, 4L, 1600L },
                    { 25L, 3L, 1599L },
                    { 25L, 2L, 1598L },
                    { 24L, 77L, 1597L },
                    { 24L, 76L, 1596L },
                    { 24L, 75L, 1595L },
                    { 24L, 74L, 1594L },
                    { 24L, 73L, 1593L },
                    { 24L, 72L, 1592L },
                    { 24L, 71L, 1591L },
                    { 24L, 70L, 1590L },
                    { 24L, 68L, 1588L },
                    { 28L, 76L, 1900L },
                    { 16L, 77L, 989L },
                    { 16L, 75L, 987L },
                    { 8L, 6L, 386L },
                    { 8L, 5L, 385L },
                    { 8L, 4L, 384L },
                    { 8L, 3L, 383L },
                    { 8L, 2L, 382L },
                    { 7L, 77L, 381L },
                    { 7L, 76L, 380L },
                    { 7L, 75L, 379L },
                    { 7L, 74L, 378L },
                    { 7L, 73L, 377L },
                    { 7L, 72L, 376L },
                    { 8L, 7L, 387L },
                    { 7L, 71L, 375L },
                    { 7L, 69L, 373L },
                    { 7L, 68L, 372L },
                    { 7L, 67L, 371L },
                    { 7L, 66L, 370L },
                    { 7L, 65L, 369L },
                    { 7L, 64L, 368L },
                    { 7L, 63L, 367L },
                    { 7L, 62L, 366L },
                    { 7L, 61L, 365L },
                    { 7L, 60L, 364L },
                    { 7L, 59L, 363L },
                    { 7L, 70L, 374L },
                    { 8L, 8L, 388L },
                    { 8L, 9L, 389L },
                    { 8L, 10L, 390L },
                    { 8L, 35L, 415L },
                    { 8L, 34L, 414L },
                    { 8L, 33L, 413L },
                    { 8L, 32L, 412L },
                    { 8L, 31L, 411L },
                    { 8L, 30L, 410L },
                    { 8L, 29L, 409L },
                    { 8L, 28L, 408L },
                    { 8L, 27L, 407L },
                    { 8L, 26L, 406L },
                    { 8L, 25L, 405L },
                    { 8L, 24L, 404L },
                    { 8L, 23L, 403L },
                    { 8L, 22L, 402L },
                    { 8L, 21L, 401L },
                    { 8L, 20L, 400L },
                    { 8L, 19L, 399L },
                    { 8L, 18L, 398L },
                    { 8L, 17L, 397L },
                    { 8L, 16L, 396L },
                    { 8L, 15L, 395L },
                    { 8L, 14L, 394L },
                    { 8L, 13L, 393L },
                    { 8L, 12L, 392L },
                    { 8L, 11L, 391L },
                    { 7L, 58L, 362L },
                    { 8L, 36L, 416L },
                    { 7L, 57L, 361L },
                    { 7L, 55L, 359L },
                    { 7L, 25L, 329L },
                    { 7L, 24L, 328L },
                    { 7L, 23L, 327L },
                    { 7L, 22L, 326L },
                    { 7L, 21L, 325L },
                    { 7L, 20L, 324L },
                    { 7L, 19L, 323L },
                    { 7L, 18L, 322L },
                    { 7L, 17L, 321L },
                    { 7L, 16L, 320L },
                    { 7L, 15L, 319L },
                    { 7L, 26L, 330L },
                    { 7L, 14L, 318L },
                    { 7L, 12L, 316L },
                    { 7L, 11L, 315L },
                    { 7L, 10L, 314L },
                    { 7L, 9L, 313L },
                    { 7L, 8L, 312L },
                    { 7L, 7L, 311L },
                    { 7L, 6L, 310L },
                    { 7L, 5L, 309L },
                    { 7L, 4L, 308L },
                    { 7L, 3L, 307L },
                    { 7L, 2L, 306L },
                    { 7L, 13L, 317L },
                    { 7L, 27L, 331L },
                    { 7L, 28L, 332L },
                    { 7L, 29L, 333L },
                    { 7L, 54L, 358L },
                    { 7L, 53L, 357L },
                    { 7L, 52L, 356L },
                    { 7L, 51L, 355L },
                    { 7L, 50L, 354L },
                    { 7L, 49L, 353L },
                    { 7L, 48L, 352L },
                    { 7L, 47L, 351L },
                    { 7L, 46L, 350L },
                    { 7L, 45L, 349L },
                    { 7L, 44L, 348L },
                    { 7L, 43L, 347L },
                    { 7L, 42L, 346L },
                    { 7L, 41L, 345L },
                    { 7L, 40L, 344L },
                    { 7L, 39L, 343L },
                    { 7L, 38L, 342L },
                    { 7L, 37L, 341L },
                    { 7L, 36L, 340L },
                    { 7L, 35L, 339L },
                    { 7L, 34L, 338L },
                    { 7L, 33L, 337L },
                    { 7L, 32L, 336L },
                    { 7L, 31L, 335L },
                    { 7L, 30L, 334L },
                    { 7L, 56L, 360L },
                    { 7L, 1L, 305L },
                    { 8L, 37L, 417L },
                    { 8L, 39L, 419L },
                    { 11L, 44L, 576L },
                    { 11L, 43L, 575L },
                    { 11L, 42L, 574L },
                    { 11L, 41L, 573L },
                    { 11L, 40L, 572L },
                    { 11L, 39L, 571L },
                    { 11L, 38L, 570L },
                    { 11L, 37L, 569L },
                    { 11L, 36L, 568L },
                    { 11L, 35L, 567L },
                    { 11L, 34L, 566L },
                    { 11L, 45L, 577L },
                    { 11L, 33L, 565L },
                    { 11L, 31L, 563L },
                    { 11L, 30L, 562L },
                    { 11L, 29L, 561L },
                    { 11L, 28L, 560L },
                    { 11L, 27L, 559L },
                    { 11L, 26L, 558L },
                    { 11L, 25L, 557L },
                    { 11L, 24L, 556L },
                    { 11L, 23L, 555L },
                    { 11L, 22L, 554L },
                    { 11L, 21L, 553L },
                    { 11L, 32L, 564L },
                    { 11L, 46L, 578L },
                    { 11L, 47L, 579L },
                    { 11L, 48L, 580L },
                    { 11L, 73L, 605L },
                    { 11L, 72L, 604L },
                    { 11L, 71L, 603L },
                    { 11L, 70L, 602L },
                    { 11L, 69L, 601L },
                    { 11L, 68L, 600L },
                    { 11L, 67L, 599L },
                    { 11L, 66L, 598L },
                    { 11L, 65L, 597L },
                    { 11L, 64L, 596L },
                    { 11L, 63L, 595L },
                    { 11L, 62L, 594L },
                    { 11L, 61L, 593L },
                    { 11L, 60L, 592L },
                    { 11L, 59L, 591L },
                    { 11L, 58L, 590L },
                    { 11L, 57L, 589L },
                    { 11L, 56L, 588L },
                    { 11L, 55L, 587L },
                    { 11L, 54L, 586L },
                    { 11L, 53L, 585L },
                    { 11L, 52L, 584L },
                    { 11L, 51L, 583L },
                    { 11L, 50L, 582L },
                    { 11L, 49L, 581L },
                    { 11L, 20L, 552L },
                    { 8L, 38L, 418L },
                    { 11L, 19L, 551L },
                    { 11L, 17L, 549L },
                    { 8L, 63L, 443L },
                    { 8L, 62L, 442L },
                    { 8L, 61L, 441L },
                    { 8L, 60L, 440L },
                    { 8L, 59L, 439L },
                    { 8L, 58L, 438L },
                    { 8L, 57L, 437L },
                    { 8L, 56L, 436L },
                    { 8L, 55L, 435L },
                    { 8L, 54L, 434L },
                    { 8L, 53L, 433L },
                    { 8L, 64L, 444L },
                    { 8L, 52L, 432L },
                    { 8L, 50L, 430L },
                    { 8L, 49L, 429L },
                    { 8L, 48L, 428L },
                    { 8L, 47L, 427L },
                    { 8L, 46L, 426L },
                    { 8L, 45L, 425L },
                    { 8L, 44L, 424L },
                    { 8L, 43L, 423L },
                    { 8L, 42L, 422L },
                    { 8L, 41L, 421L },
                    { 8L, 40L, 420L },
                    { 8L, 51L, 431L },
                    { 8L, 65L, 445L },
                    { 8L, 66L, 446L },
                    { 8L, 67L, 447L },
                    { 11L, 16L, 548L },
                    { 11L, 15L, 547L },
                    { 11L, 14L, 546L },
                    { 11L, 13L, 545L },
                    { 11L, 12L, 544L },
                    { 11L, 11L, 543L },
                    { 11L, 10L, 542L },
                    { 11L, 9L, 541L },
                    { 11L, 8L, 540L },
                    { 11L, 7L, 539L },
                    { 11L, 6L, 538L },
                    { 11L, 5L, 537L },
                    { 11L, 4L, 536L },
                    { 11L, 3L, 535L },
                    { 11L, 2L, 534L },
                    { 8L, 77L, 457L },
                    { 8L, 76L, 456L },
                    { 8L, 75L, 455L },
                    { 8L, 74L, 454L },
                    { 8L, 73L, 453L },
                    { 8L, 72L, 452L },
                    { 8L, 71L, 451L },
                    { 8L, 70L, 450L },
                    { 8L, 69L, 449L },
                    { 8L, 68L, 448L },
                    { 11L, 18L, 550L },
                    { 11L, 74L, 606L },
                    { 6L, 77L, 304L },
                    { 6L, 75L, 302L },
                    { 3L, 7L, 158L },
                    { 3L, 6L, 157L },
                    { 3L, 5L, 156L },
                    { 3L, 4L, 155L },
                    { 3L, 3L, 154L },
                    { 3L, 2L, 153L },
                    { 2L, 77L, 152L },
                    { 2L, 76L, 151L },
                    { 2L, 75L, 150L },
                    { 2L, 74L, 149L },
                    { 2L, 73L, 148L },
                    { 3L, 8L, 159L },
                    { 2L, 72L, 147L },
                    { 2L, 70L, 145L },
                    { 2L, 69L, 144L },
                    { 2L, 68L, 143L },
                    { 2L, 67L, 142L },
                    { 2L, 66L, 141L },
                    { 2L, 65L, 140L },
                    { 2L, 64L, 139L },
                    { 2L, 63L, 138L },
                    { 2L, 62L, 137L },
                    { 2L, 61L, 136L },
                    { 2L, 60L, 135L },
                    { 2L, 71L, 146L },
                    { 3L, 9L, 160L },
                    { 3L, 10L, 161L },
                    { 3L, 11L, 162L },
                    { 3L, 36L, 187L },
                    { 3L, 35L, 186L },
                    { 3L, 34L, 185L },
                    { 3L, 33L, 184L },
                    { 3L, 32L, 183L },
                    { 3L, 31L, 182L },
                    { 3L, 30L, 181L },
                    { 3L, 29L, 180L },
                    { 3L, 28L, 179L },
                    { 3L, 27L, 178L },
                    { 3L, 26L, 177L },
                    { 3L, 25L, 176L },
                    { 3L, 24L, 175L },
                    { 3L, 23L, 174L },
                    { 3L, 22L, 173L },
                    { 3L, 21L, 172L },
                    { 3L, 20L, 171L },
                    { 3L, 19L, 170L },
                    { 3L, 18L, 169L },
                    { 3L, 17L, 168L },
                    { 3L, 16L, 167L },
                    { 3L, 15L, 166L },
                    { 3L, 14L, 165L },
                    { 3L, 13L, 164L },
                    { 3L, 12L, 163L },
                    { 2L, 59L, 134L },
                    { 3L, 37L, 188L },
                    { 2L, 58L, 133L },
                    { 2L, 56L, 131L },
                    { 2L, 26L, 101L },
                    { 2L, 25L, 100L },
                    { 2L, 24L, 99L },
                    { 2L, 23L, 98L },
                    { 2L, 22L, 97L },
                    { 2L, 21L, 96L },
                    { 2L, 20L, 95L },
                    { 2L, 19L, 94L },
                    { 2L, 18L, 93L },
                    { 2L, 17L, 92L },
                    { 2L, 16L, 91L },
                    { 2L, 27L, 102L },
                    { 2L, 15L, 90L },
                    { 2L, 13L, 88L },
                    { 2L, 12L, 87L },
                    { 2L, 11L, 86L },
                    { 2L, 10L, 85L },
                    { 2L, 9L, 84L },
                    { 2L, 8L, 83L },
                    { 2L, 7L, 82L },
                    { 2L, 6L, 81L },
                    { 2L, 5L, 80L },
                    { 2L, 4L, 79L },
                    { 2L, 3L, 78L },
                    { 2L, 14L, 89L },
                    { 2L, 28L, 103L },
                    { 2L, 29L, 104L },
                    { 2L, 30L, 105L },
                    { 2L, 55L, 130L },
                    { 2L, 54L, 129L },
                    { 2L, 53L, 128L },
                    { 2L, 52L, 127L },
                    { 2L, 51L, 126L },
                    { 2L, 50L, 125L },
                    { 2L, 49L, 124L },
                    { 2L, 48L, 123L },
                    { 2L, 47L, 122L },
                    { 2L, 46L, 121L },
                    { 2L, 45L, 120L },
                    { 2L, 44L, 119L },
                    { 2L, 43L, 118L },
                    { 2L, 42L, 117L },
                    { 2L, 41L, 116L },
                    { 2L, 40L, 115L },
                    { 2L, 39L, 114L },
                    { 2L, 38L, 113L },
                    { 2L, 37L, 112L },
                    { 2L, 36L, 111L },
                    { 2L, 35L, 110L },
                    { 2L, 34L, 109L },
                    { 2L, 33L, 108L },
                    { 2L, 32L, 107L },
                    { 2L, 31L, 106L },
                    { 2L, 57L, 132L },
                    { 6L, 76L, 303L },
                    { 3L, 38L, 189L },
                    { 3L, 40L, 191L },
                    { 6L, 45L, 272L },
                    { 6L, 44L, 271L },
                    { 6L, 43L, 270L },
                    { 6L, 42L, 269L },
                    { 6L, 41L, 268L },
                    { 6L, 40L, 267L },
                    { 6L, 39L, 266L },
                    { 6L, 38L, 265L },
                    { 6L, 37L, 264L },
                    { 6L, 36L, 263L },
                    { 6L, 35L, 262L },
                    { 6L, 46L, 273L },
                    { 6L, 34L, 261L },
                    { 6L, 32L, 259L },
                    { 6L, 31L, 258L },
                    { 6L, 30L, 257L },
                    { 6L, 29L, 256L },
                    { 6L, 28L, 255L },
                    { 6L, 27L, 254L },
                    { 6L, 26L, 253L },
                    { 6L, 25L, 252L },
                    { 6L, 24L, 251L },
                    { 6L, 23L, 250L },
                    { 6L, 22L, 249L },
                    { 6L, 33L, 260L },
                    { 6L, 47L, 274L },
                    { 6L, 48L, 275L },
                    { 6L, 49L, 276L },
                    { 6L, 74L, 301L },
                    { 6L, 73L, 300L },
                    { 6L, 72L, 299L },
                    { 6L, 71L, 298L },
                    { 6L, 70L, 297L },
                    { 6L, 69L, 296L },
                    { 6L, 68L, 295L },
                    { 6L, 67L, 294L },
                    { 6L, 66L, 293L },
                    { 6L, 65L, 292L },
                    { 6L, 64L, 291L },
                    { 6L, 63L, 290L },
                    { 6L, 62L, 289L },
                    { 6L, 61L, 288L },
                    { 6L, 60L, 287L },
                    { 6L, 59L, 286L },
                    { 6L, 58L, 285L },
                    { 6L, 57L, 284L },
                    { 6L, 56L, 283L },
                    { 6L, 55L, 282L },
                    { 6L, 54L, 281L },
                    { 6L, 53L, 280L },
                    { 6L, 52L, 279L },
                    { 6L, 51L, 278L },
                    { 6L, 50L, 277L },
                    { 6L, 21L, 248L },
                    { 3L, 39L, 190L },
                    { 6L, 20L, 247L },
                    { 6L, 18L, 245L },
                    { 3L, 64L, 215L },
                    { 3L, 63L, 214L },
                    { 3L, 62L, 213L },
                    { 3L, 61L, 212L },
                    { 3L, 60L, 211L },
                    { 3L, 59L, 210L },
                    { 3L, 58L, 209L },
                    { 3L, 57L, 208L },
                    { 3L, 56L, 207L },
                    { 3L, 55L, 206L },
                    { 3L, 54L, 205L },
                    { 3L, 65L, 216L },
                    { 3L, 53L, 204L },
                    { 3L, 51L, 202L },
                    { 3L, 50L, 201L },
                    { 3L, 49L, 200L },
                    { 3L, 48L, 199L },
                    { 3L, 47L, 198L },
                    { 3L, 46L, 197L },
                    { 3L, 45L, 196L },
                    { 3L, 44L, 195L },
                    { 3L, 43L, 194L },
                    { 3L, 42L, 193L },
                    { 3L, 41L, 192L },
                    { 3L, 52L, 203L },
                    { 3L, 66L, 217L },
                    { 3L, 67L, 218L },
                    { 3L, 68L, 219L },
                    { 6L, 17L, 244L },
                    { 6L, 16L, 243L },
                    { 6L, 15L, 242L },
                    { 6L, 14L, 241L },
                    { 6L, 13L, 240L },
                    { 6L, 12L, 239L },
                    { 6L, 11L, 238L },
                    { 6L, 10L, 237L },
                    { 6L, 9L, 236L },
                    { 6L, 8L, 235L },
                    { 6L, 7L, 234L },
                    { 6L, 6L, 233L },
                    { 6L, 5L, 232L },
                    { 6L, 4L, 231L },
                    { 6L, 3L, 230L },
                    { 6L, 2L, 229L },
                    { 3L, 77L, 228L },
                    { 3L, 76L, 227L },
                    { 3L, 75L, 226L },
                    { 3L, 74L, 225L },
                    { 3L, 73L, 224L },
                    { 3L, 72L, 223L },
                    { 3L, 71L, 222L },
                    { 3L, 70L, 221L },
                    { 3L, 69L, 220L },
                    { 6L, 19L, 246L },
                    { 11L, 75L, 607L },
                    { 11L, 76L, 608L },
                    { 11L, 77L, 609L },
                    { 15L, 7L, 843L },
                    { 15L, 6L, 842L },
                    { 15L, 5L, 841L },
                    { 15L, 4L, 840L },
                    { 15L, 3L, 839L },
                    { 15L, 2L, 838L },
                    { 14L, 77L, 837L },
                    { 14L, 76L, 836L },
                    { 14L, 75L, 835L },
                    { 14L, 74L, 834L },
                    { 14L, 73L, 833L },
                    { 15L, 8L, 844L },
                    { 14L, 72L, 832L },
                    { 14L, 70L, 830L },
                    { 14L, 69L, 829L },
                    { 14L, 68L, 828L },
                    { 14L, 67L, 827L },
                    { 14L, 66L, 826L },
                    { 14L, 65L, 825L },
                    { 14L, 64L, 824L },
                    { 14L, 63L, 823L },
                    { 14L, 62L, 822L },
                    { 14L, 61L, 821L },
                    { 14L, 60L, 820L },
                    { 14L, 71L, 831L },
                    { 15L, 9L, 845L },
                    { 15L, 10L, 846L },
                    { 15L, 11L, 847L }
                });

            migrationBuilder.InsertData(
                table: "ProvincialDepartmentProvince",
                columns: new[] { "ProvincialDepartmentID", "ProvinceId", "Id" },
                values: new object[,]
                {
                    { 15L, 36L, 872L },
                    { 15L, 35L, 871L },
                    { 15L, 34L, 870L },
                    { 15L, 33L, 869L },
                    { 15L, 32L, 868L },
                    { 15L, 31L, 867L },
                    { 15L, 30L, 866L },
                    { 15L, 29L, 865L },
                    { 15L, 28L, 864L },
                    { 15L, 27L, 863L },
                    { 15L, 26L, 862L },
                    { 15L, 25L, 861L },
                    { 15L, 24L, 860L },
                    { 15L, 23L, 859L },
                    { 15L, 22L, 858L },
                    { 15L, 21L, 857L },
                    { 15L, 20L, 856L },
                    { 15L, 19L, 855L },
                    { 15L, 18L, 854L },
                    { 15L, 17L, 853L },
                    { 15L, 16L, 852L },
                    { 15L, 15L, 851L },
                    { 15L, 14L, 850L },
                    { 15L, 13L, 849L },
                    { 15L, 12L, 848L },
                    { 14L, 59L, 819L },
                    { 15L, 37L, 873L },
                    { 14L, 58L, 818L },
                    { 14L, 56L, 816L },
                    { 14L, 26L, 786L },
                    { 14L, 25L, 785L },
                    { 14L, 24L, 784L },
                    { 14L, 23L, 783L },
                    { 14L, 22L, 782L },
                    { 14L, 21L, 781L },
                    { 14L, 20L, 780L },
                    { 14L, 19L, 779L },
                    { 14L, 18L, 778L },
                    { 14L, 17L, 777L },
                    { 14L, 16L, 776L },
                    { 14L, 27L, 787L },
                    { 14L, 15L, 775L },
                    { 14L, 13L, 773L },
                    { 14L, 12L, 772L },
                    { 14L, 11L, 771L },
                    { 14L, 10L, 770L },
                    { 14L, 9L, 769L },
                    { 14L, 8L, 768L },
                    { 14L, 7L, 767L },
                    { 14L, 6L, 766L },
                    { 14L, 5L, 765L },
                    { 14L, 4L, 764L },
                    { 14L, 3L, 763L },
                    { 14L, 14L, 774L },
                    { 14L, 28L, 788L },
                    { 14L, 29L, 789L },
                    { 14L, 30L, 790L },
                    { 14L, 55L, 815L },
                    { 14L, 54L, 814L },
                    { 14L, 53L, 813L },
                    { 14L, 52L, 812L },
                    { 14L, 51L, 811L },
                    { 14L, 50L, 810L },
                    { 14L, 49L, 809L },
                    { 14L, 48L, 808L },
                    { 14L, 47L, 807L },
                    { 14L, 46L, 806L },
                    { 14L, 45L, 805L },
                    { 14L, 44L, 804L },
                    { 14L, 43L, 803L },
                    { 14L, 42L, 802L },
                    { 14L, 41L, 801L },
                    { 14L, 40L, 800L },
                    { 14L, 39L, 799L },
                    { 14L, 38L, 798L },
                    { 14L, 37L, 797L },
                    { 14L, 36L, 796L },
                    { 14L, 35L, 795L },
                    { 14L, 34L, 794L },
                    { 14L, 33L, 793L },
                    { 14L, 32L, 792L },
                    { 14L, 31L, 791L },
                    { 14L, 57L, 817L },
                    { 14L, 2L, 762L },
                    { 15L, 38L, 874L },
                    { 15L, 40L, 876L },
                    { 16L, 45L, 957L },
                    { 16L, 44L, 956L },
                    { 16L, 43L, 955L },
                    { 16L, 42L, 954L },
                    { 16L, 41L, 953L },
                    { 16L, 40L, 952L },
                    { 16L, 39L, 951L },
                    { 16L, 38L, 950L },
                    { 16L, 37L, 949L },
                    { 16L, 36L, 948L },
                    { 16L, 35L, 947L },
                    { 16L, 46L, 958L },
                    { 16L, 34L, 946L },
                    { 16L, 32L, 944L },
                    { 16L, 31L, 943L },
                    { 16L, 30L, 942L },
                    { 16L, 29L, 941L },
                    { 16L, 28L, 940L },
                    { 16L, 27L, 939L },
                    { 16L, 26L, 938L },
                    { 16L, 25L, 937L },
                    { 16L, 24L, 936L },
                    { 16L, 23L, 935L },
                    { 16L, 22L, 934L },
                    { 16L, 33L, 945L },
                    { 16L, 47L, 959L },
                    { 16L, 48L, 960L },
                    { 16L, 49L, 961L },
                    { 16L, 74L, 986L },
                    { 16L, 73L, 985L },
                    { 16L, 72L, 984L },
                    { 16L, 71L, 983L },
                    { 16L, 70L, 982L },
                    { 16L, 69L, 981L },
                    { 16L, 68L, 980L },
                    { 16L, 67L, 979L },
                    { 16L, 66L, 978L },
                    { 16L, 65L, 977L },
                    { 16L, 64L, 976L },
                    { 16L, 63L, 975L },
                    { 16L, 62L, 974L },
                    { 16L, 61L, 973L },
                    { 16L, 60L, 972L },
                    { 16L, 59L, 971L },
                    { 16L, 58L, 970L },
                    { 16L, 57L, 969L },
                    { 16L, 56L, 968L },
                    { 16L, 55L, 967L },
                    { 16L, 54L, 966L },
                    { 16L, 53L, 965L },
                    { 16L, 52L, 964L },
                    { 16L, 51L, 963L },
                    { 16L, 50L, 962L },
                    { 16L, 21L, 933L },
                    { 15L, 39L, 875L },
                    { 16L, 20L, 932L },
                    { 16L, 18L, 930L },
                    { 15L, 64L, 900L },
                    { 15L, 63L, 899L },
                    { 15L, 62L, 898L },
                    { 15L, 61L, 897L },
                    { 15L, 60L, 896L },
                    { 15L, 59L, 895L },
                    { 15L, 58L, 894L },
                    { 15L, 57L, 893L },
                    { 15L, 56L, 892L },
                    { 15L, 55L, 891L },
                    { 15L, 54L, 890L },
                    { 15L, 65L, 901L },
                    { 15L, 53L, 889L },
                    { 15L, 51L, 887L },
                    { 15L, 50L, 886L },
                    { 15L, 49L, 885L },
                    { 15L, 48L, 884L },
                    { 15L, 47L, 883L },
                    { 15L, 46L, 882L },
                    { 15L, 45L, 881L },
                    { 15L, 44L, 880L },
                    { 15L, 43L, 879L },
                    { 15L, 42L, 878L },
                    { 15L, 41L, 877L },
                    { 15L, 52L, 888L },
                    { 15L, 66L, 902L },
                    { 15L, 67L, 903L },
                    { 15L, 68L, 904L },
                    { 16L, 17L, 929L },
                    { 16L, 16L, 928L },
                    { 16L, 15L, 927L },
                    { 16L, 14L, 926L },
                    { 16L, 13L, 925L },
                    { 16L, 12L, 924L },
                    { 16L, 11L, 923L },
                    { 16L, 10L, 922L },
                    { 16L, 9L, 921L },
                    { 16L, 8L, 920L },
                    { 16L, 7L, 919L },
                    { 16L, 6L, 918L },
                    { 16L, 5L, 917L },
                    { 16L, 4L, 916L },
                    { 16L, 3L, 915L },
                    { 16L, 2L, 914L },
                    { 15L, 77L, 913L },
                    { 15L, 76L, 912L },
                    { 15L, 75L, 911L },
                    { 15L, 74L, 910L },
                    { 15L, 73L, 909L },
                    { 15L, 72L, 908L },
                    { 15L, 71L, 907L },
                    { 15L, 70L, 906L },
                    { 15L, 69L, 905L },
                    { 16L, 19L, 931L },
                    { 13L, 77L, 761L },
                    { 13L, 76L, 760L },
                    { 13L, 75L, 759L },
                    { 12L, 6L, 614L },
                    { 12L, 5L, 613L },
                    { 12L, 4L, 612L },
                    { 12L, 3L, 611L },
                    { 12L, 2L, 610L },
                    { 9L, 77L, 533L },
                    { 9L, 76L, 532L },
                    { 9L, 75L, 531L },
                    { 9L, 74L, 530L },
                    { 9L, 73L, 529L },
                    { 9L, 72L, 528L },
                    { 12L, 7L, 615L },
                    { 9L, 71L, 527L },
                    { 9L, 69L, 525L },
                    { 9L, 68L, 524L },
                    { 9L, 67L, 523L },
                    { 9L, 66L, 522L },
                    { 9L, 65L, 521L },
                    { 9L, 64L, 520L },
                    { 9L, 63L, 519L },
                    { 9L, 62L, 518L },
                    { 9L, 61L, 517L },
                    { 9L, 60L, 516L },
                    { 9L, 59L, 515L },
                    { 9L, 70L, 526L },
                    { 12L, 8L, 616L },
                    { 12L, 9L, 617L },
                    { 12L, 10L, 618L },
                    { 12L, 35L, 643L },
                    { 12L, 34L, 642L },
                    { 12L, 33L, 641L },
                    { 12L, 32L, 640L },
                    { 12L, 31L, 639L },
                    { 12L, 30L, 638L },
                    { 12L, 29L, 637L },
                    { 12L, 28L, 636L },
                    { 12L, 27L, 635L },
                    { 12L, 26L, 634L },
                    { 12L, 25L, 633L },
                    { 12L, 24L, 632L },
                    { 12L, 23L, 631L },
                    { 12L, 22L, 630L },
                    { 12L, 21L, 629L },
                    { 12L, 20L, 628L },
                    { 12L, 19L, 627L },
                    { 12L, 18L, 626L },
                    { 12L, 17L, 625L },
                    { 12L, 16L, 624L },
                    { 12L, 15L, 623L },
                    { 12L, 14L, 622L },
                    { 12L, 13L, 621L },
                    { 12L, 12L, 620L },
                    { 12L, 11L, 619L },
                    { 9L, 58L, 514L },
                    { 12L, 36L, 644L },
                    { 9L, 57L, 513L },
                    { 9L, 55L, 511L },
                    { 9L, 25L, 481L },
                    { 9L, 24L, 480L },
                    { 9L, 23L, 479L },
                    { 9L, 22L, 478L },
                    { 9L, 21L, 477L },
                    { 9L, 20L, 476L },
                    { 9L, 19L, 475L },
                    { 9L, 18L, 474L },
                    { 9L, 17L, 473L },
                    { 9L, 16L, 472L },
                    { 9L, 15L, 471L },
                    { 9L, 26L, 482L },
                    { 9L, 14L, 470L },
                    { 9L, 12L, 468L },
                    { 9L, 11L, 467L },
                    { 9L, 10L, 466L },
                    { 9L, 9L, 465L },
                    { 9L, 8L, 464L },
                    { 9L, 7L, 463L },
                    { 9L, 6L, 462L },
                    { 9L, 5L, 461L },
                    { 9L, 4L, 460L },
                    { 9L, 3L, 459L },
                    { 9L, 2L, 458L },
                    { 9L, 13L, 469L },
                    { 9L, 27L, 483L },
                    { 9L, 28L, 484L },
                    { 9L, 29L, 485L },
                    { 9L, 54L, 510L },
                    { 9L, 53L, 509L },
                    { 9L, 52L, 508L },
                    { 9L, 51L, 507L },
                    { 9L, 50L, 506L },
                    { 9L, 49L, 505L },
                    { 9L, 48L, 504L },
                    { 9L, 47L, 503L },
                    { 9L, 46L, 502L },
                    { 9L, 45L, 501L },
                    { 9L, 44L, 500L },
                    { 9L, 43L, 499L },
                    { 9L, 42L, 498L },
                    { 9L, 41L, 497L },
                    { 9L, 40L, 496L },
                    { 9L, 39L, 495L },
                    { 9L, 38L, 494L },
                    { 9L, 37L, 493L },
                    { 9L, 36L, 492L },
                    { 9L, 35L, 491L },
                    { 9L, 34L, 490L },
                    { 9L, 33L, 489L },
                    { 9L, 32L, 488L },
                    { 9L, 31L, 487L },
                    { 9L, 30L, 486L },
                    { 9L, 56L, 512L },
                    { 12L, 37L, 645L },
                    { 12L, 38L, 646L },
                    { 12L, 39L, 647L },
                    { 13L, 45L, 729L },
                    { 13L, 44L, 728L },
                    { 13L, 43L, 727L },
                    { 13L, 42L, 726L },
                    { 13L, 41L, 725L },
                    { 13L, 40L, 724L },
                    { 13L, 39L, 723L },
                    { 13L, 38L, 722L },
                    { 13L, 37L, 721L },
                    { 13L, 36L, 720L },
                    { 13L, 35L, 719L },
                    { 13L, 46L, 730L },
                    { 13L, 34L, 718L },
                    { 13L, 32L, 716L },
                    { 13L, 31L, 715L },
                    { 13L, 30L, 714L },
                    { 13L, 29L, 713L },
                    { 13L, 28L, 712L },
                    { 13L, 27L, 711L },
                    { 13L, 26L, 710L },
                    { 13L, 25L, 709L },
                    { 13L, 24L, 708L },
                    { 13L, 23L, 707L },
                    { 13L, 22L, 706L },
                    { 13L, 33L, 717L },
                    { 13L, 47L, 731L },
                    { 13L, 48L, 732L },
                    { 13L, 49L, 733L },
                    { 13L, 74L, 758L },
                    { 13L, 73L, 757L },
                    { 13L, 72L, 756L },
                    { 13L, 71L, 755L },
                    { 13L, 70L, 754L },
                    { 13L, 69L, 753L },
                    { 13L, 68L, 752L },
                    { 13L, 67L, 751L },
                    { 13L, 66L, 750L },
                    { 13L, 65L, 749L },
                    { 13L, 64L, 748L },
                    { 13L, 63L, 747L },
                    { 13L, 62L, 746L },
                    { 13L, 61L, 745L },
                    { 13L, 60L, 744L },
                    { 13L, 59L, 743L },
                    { 13L, 58L, 742L },
                    { 13L, 57L, 741L },
                    { 13L, 56L, 740L },
                    { 13L, 55L, 739L },
                    { 13L, 54L, 738L },
                    { 13L, 53L, 737L },
                    { 13L, 52L, 736L },
                    { 13L, 51L, 735L },
                    { 13L, 50L, 734L },
                    { 13L, 21L, 705L },
                    { 13L, 20L, 704L },
                    { 13L, 19L, 703L },
                    { 13L, 18L, 702L },
                    { 12L, 64L, 672L },
                    { 12L, 63L, 671L },
                    { 12L, 62L, 670L },
                    { 12L, 61L, 669L },
                    { 12L, 60L, 668L },
                    { 12L, 59L, 667L },
                    { 12L, 58L, 666L },
                    { 12L, 57L, 665L },
                    { 12L, 56L, 664L },
                    { 12L, 55L, 663L },
                    { 12L, 54L, 662L },
                    { 12L, 53L, 661L },
                    { 12L, 52L, 660L },
                    { 12L, 51L, 659L },
                    { 12L, 50L, 658L },
                    { 12L, 49L, 657L },
                    { 12L, 48L, 656L },
                    { 12L, 47L, 655L },
                    { 12L, 46L, 654L },
                    { 12L, 45L, 653L },
                    { 12L, 44L, 652L },
                    { 12L, 43L, 651L },
                    { 12L, 42L, 650L },
                    { 12L, 41L, 649L },
                    { 12L, 40L, 648L },
                    { 12L, 65L, 673L },
                    { 16L, 76L, 988L },
                    { 12L, 66L, 674L },
                    { 12L, 68L, 676L },
                    { 13L, 17L, 701L },
                    { 13L, 16L, 700L },
                    { 13L, 15L, 699L },
                    { 13L, 14L, 698L },
                    { 13L, 13L, 697L },
                    { 13L, 12L, 696L },
                    { 13L, 11L, 695L },
                    { 13L, 10L, 694L },
                    { 13L, 9L, 693L },
                    { 13L, 8L, 692L },
                    { 13L, 7L, 691L },
                    { 13L, 6L, 690L },
                    { 13L, 5L, 689L },
                    { 13L, 4L, 688L },
                    { 13L, 3L, 687L },
                    { 13L, 2L, 686L },
                    { 12L, 77L, 685L },
                    { 12L, 76L, 684L },
                    { 12L, 75L, 683L },
                    { 12L, 74L, 682L },
                    { 12L, 73L, 681L },
                    { 12L, 72L, 680L },
                    { 12L, 71L, 679L },
                    { 12L, 70L, 678L },
                    { 12L, 69L, 677L },
                    { 12L, 67L, 675L },
                    { 28L, 77L, 1901L }
                });

            migrationBuilder.CreateIndex(
                name: "IX_CentralPolicyUsers_UserId",
                table: "CentralPolicyUsers",
                column: "UserId");
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropPrimaryKey(
                name: "PK_CentralPolicyUsers",
                table: "CentralPolicyUsers");

            migrationBuilder.DropIndex(
                name: "IX_CentralPolicyUsers_UserId",
                table: "CentralPolicyUsers");

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 3L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 4L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 5L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 6L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 7L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 8L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 9L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 10L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 11L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 12L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 13L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 14L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 15L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 16L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 17L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 18L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 19L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 20L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 21L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 22L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 23L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 25L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 26L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 27L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 30L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 31L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 32L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 33L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 34L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 35L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 36L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 37L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 38L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 39L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 40L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 41L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 42L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 43L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 44L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 45L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 47L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 48L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 49L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 51L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 52L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 53L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 54L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 55L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 57L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 58L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 61L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 62L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 63L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 64L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 65L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 66L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 67L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 68L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 69L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 70L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 71L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 72L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 74L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 75L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 76L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 77L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 78L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 80L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 81L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 82L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 83L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 84L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 85L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 86L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 87L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 88L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 89L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 92L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 93L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 94L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 95L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 96L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 97L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 98L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 99L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 101L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 109L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 113L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 114L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 115L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 120L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 122L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 123L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 124L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 125L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 126L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 127L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 128L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 129L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 130L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 131L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 132L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 134L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 135L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 136L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 137L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 138L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 139L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 140L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 141L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 143L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 144L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 145L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 146L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 147L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 148L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 1L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 2L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 3L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 6L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 1L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 7L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 8L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 9L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 11L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 12L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 13L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 14L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 15L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 16L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 17L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 18L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 19L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 20L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 21L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 22L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 23L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 24L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 25L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 26L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 27L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 2L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 3L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 4L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 5L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 6L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 7L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 8L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 9L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 10L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 11L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 12L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 13L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 14L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 15L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 16L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 17L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 18L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 19L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 20L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 21L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 22L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 23L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 24L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 25L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 26L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 27L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 28L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 29L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 30L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 31L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 32L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 33L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 34L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 35L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 36L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 37L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 38L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 39L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 40L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 41L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 42L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 43L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 44L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 45L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 46L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 47L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 48L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 49L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 50L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 51L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 52L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 53L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 54L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 55L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 56L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 57L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 58L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 59L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 60L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 61L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 62L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 63L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 64L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 65L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 66L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 67L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 68L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 69L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 70L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 71L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 72L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 73L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 74L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 75L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 76L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartmentProvince",
                keyColumns: new[] { "ProvincialDepartmentID", "ProvinceId" },
                keyValues: new object[] { 28L, 77L });

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 4L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 5L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 10L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 50L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 56L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 91L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 1L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 2L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 3L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 6L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 7L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 8L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 9L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 11L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 12L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 13L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 14L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 15L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 16L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 17L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 18L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 19L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 20L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 21L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 22L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 23L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 24L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 25L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 26L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 27L);

            migrationBuilder.DeleteData(
                table: "ProvincialDepartments",
                keyColumn: "Id",
                keyValue: 28L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 24L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 46L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 59L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 60L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 73L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 79L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 90L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 102L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 103L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 104L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 105L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 106L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 107L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 108L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 110L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 111L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 112L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 116L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 117L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 118L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 119L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 121L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 133L);

            migrationBuilder.DeleteData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 142L);

            migrationBuilder.DropColumn(
                name: "AnswerUserId",
                table: "ExecutiveOrders");

            migrationBuilder.AddPrimaryKey(
                name: "PK_CentralPolicyUsers",
                table: "CentralPolicyUsers",
                columns: new[] { "UserId", "CentralPolicyId" });

          

            migrationBuilder.UpdateData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 1L,
                column: "Name",
                value: "ทหารบก");

            migrationBuilder.UpdateData(
                table: "Departments",
                keyColumn: "Id",
                keyValue: 2L,
                columns: new[] { "MinistryId", "Name" },
                values: new object[] { 2L, "อย." });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 1L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã ·Õè 313/2562 Å§ÇÑ¹·Õè 28 µØÅÒ¤Á 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 2L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 102/2562 Å§ÇÑ¹·Õè 10 ¾ÄÉÀÒ¤Á 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 3L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 5/2562 Å§ÇÑ¹·Õè 7 Á¡ÃÒ¤Á 2562" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 4L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾ÅàÍ¡ ªÑÂÇÑ²¹ì â¦ÊÔµÒÀÒ (à¢µÊèÇ¹¡ÅÒ§), ¹Ò§ÊÒÇÊØÃØè§ÅÑ¡É³ì àÁ¦ÐÍÓ¹ÇÂªÑÂ (à¢µ1,12), ¹Ò§ÊØÁÔµÃÒ ÍµÔÈÑ¾·ì (à¢µ2,14.17), ¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ (à¢µ3,9), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì (à¢µ4,18), ¹ÒÂ¸ÊÃ³ìÍÑ±²ì ¸¹Ô·¸Ô¾Ñ¹¸ì (à¢µ5,7,10), ¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ (à¢µ6,16), ¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã (à¢µ8,13), ¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì (à¢µ11,15)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ Ê»¹. ·Õè 262/2561 Å§ÇÑ¹·Õè 16 µØÅÒ¤Á 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 5L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µÊèÇ¹¡ÅÒ§,2,3),¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ(à¢µ1,4,7),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ5,6),¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µ8,9),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13,14),¹Ò§´Ç§µÒ µÑ¹âª(à¢µ15,16),¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì(à¢µ15,16,17,18)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 255/2561 Å§ÇÑ¹·Õè 5 µØÅÒ¤Á 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 6L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µÊèÇ¹¡ÅÒ§,2,3),¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ(à¢µ1,4,7),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ5,6),¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µ8,9),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13,14), ¹ÒÂ¾ÕÃÐ ·Í§â¾¸Ôì(à¢µ15,16,17,18)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 206/2561 Å§ÇÑ¹·Õè 24 ÊÔ§ËÒ¤Á 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 7L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,5),¹ÒÂ¹ÃÔÊªÑÂ »éÍÁàÊ×Í(à¢µ2),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6,7),¹ÒÂ³Ã§¤ì àª×éÍºØ­ªèÇÂ(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12), ¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13), ¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15,16,17,18)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 100/2561 Å§ÇÑ¹·Õè 27 àÁÉÒÂ¹ 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 8L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,5),¹ÒÂ¹ÃÔÊªÑÂ »éÍÁàÊ×Í(à¢µ2),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6,7),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12), ¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13), ¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15,16,17,18)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 76/2561 Å§ÇÑ¹·Õè 2 àÁÉÒÂ¹ 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 9L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2,5),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6,7),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10,11),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12), ¹ÒÂ¡ÃÕ±Ò Ê¾âª¤(à¢µ13), ¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15,16,17,18)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", "¤ÓÊÑè§ ¹Ã. ·Õè 76/2561 Å§ÇÑ¹·Õè 2 àÁÉÒÂ¹ 2561" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 10L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ1,6,7),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ2,15,16),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ5, 17, 18),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10, 11, 13),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 336/2560 Å§ÇÑ¹·Õè 13 ¸Ñ¹ÇÒ¤Á 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 11L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,3,9,14),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2,5),¹ÒÂâª¤ªÑÂ à´ªÍÁÃ¸Ñ­(à¢µ4),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6, 7, 18),¹ÒÂ¾ÈÔ¹ â¡ÁÅÇÔª­ì(à¢µ8),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ10, 11, 13),¹ÒÂÈÑ¡´Ôì ÊÁºØ­âµ(à¢µ12),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ15, 16, 17)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 306/2560 Å§ÇÑ¹·Õè 20 ¾ÄÈ¨Ô¡ÒÂ¹ 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 12L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,18),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2),¹ÒÂä¾âÃ¨¹ì ÍÒ¨ÃÑ¡ÉÒ(à¢µ3,4),¹ÒÂÇÃ¾Ñ¹¸ì àÂç¹·ÃÑ¾Âì(à¢µ5,9),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6),¹Ò§»ÃÐÀÒÈÃÕ ºØ­ÇÔàÈÉ(à¢µ7,15),¾.µ.·.¾§Èì¾Ã ¾ÃÒÁ³ìàÊ¹èËì(à¢µ8),¹ÒÂÍÔÊÃÐ ÈÔÃÔÇÃÀÒ(à¢µ10),¹Ò§ÍÑ¨¨ÔÁÒ ¨Ñ¹·ÃìÊØÇÒ¹ÔªÂì(à¢µ11,14),¹Ò§ÀÑ·ÃÀÃ °ÔµÔÂÒÀÃ³ì(à¢µ12,17),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ13),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ16)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 215/2560 Å§ÇÑ¹·Õè 6 ¡Ñ¹ÂÒÂ¹ 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 13L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,18),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2),¹ÒÂä¾âÃ¨¹ì ÍÒ¨ÃÑ¡ÉÒ(à¢µ3,4),¹ÒÂÇÃ¾Ñ¹¸ì àÂç¹·ÃÑ¾Âì(à¢µ5,9),¹Ò§ÊÒÇ»ÀÑÊÁ¹ ÍÑÁÃÒÅÔ¢Ôµ(à¢µ6),¹Ò§»ÃÐÀÒÈÃÕ ºØ­ÇÔàÈÉ(à¢µ7,15),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ8,16),¹ÒÂÍÔÊÃÐ ÈÔÃÔÇÃÀÒ(à¢µ10),¹Ò§ÍÑ¨¨ÔÁÒ ¨Ñ¹·ÃìÊØÇÒ¹ÔªÂì(à¢µ11,14),¹Ò§ÀÑ·ÃÀÃ °ÔµÔÂÒÀÃ³ì(à¢µ12,17),¹Ò§ÊÒÇÍÃ¹Øª ÈÃÕ¹¹·ì(à¢µ13)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã. ·Õè 100/2560 Å§ÇÑ¹·Õè 28 ÁÕ¹Ò¤Á 2560" });

            migrationBuilder.UpdateData(
                table: "InstructionOrders",
                keyColumn: "Id",
                keyValue: 14L,
                columns: new[] { "CreateBy", "Detail", "Name", "Order" },
                values: new object[] { "¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕ", "¹ÒÂ¨ÔÃÒÂØ ¹Ñ¹·ì¸ÃÒ¸Ã(à¢µÊèÇ¹¡ÅÒ§,6,18),¾Ñ¹µÓÃÇ¨â· à¸ÕÂÃÃÑµ¹ì ÇÔàªÕÂÃÊÃÃ¤ì(à¢µ1,2),¹ÒÂä¾âÃ¨¹ì ÍÒ¨ÃÑ¡ÉÒ(à¢µ3,4),¹ÒÂÇÃ¾Ñ¹¸ì àÂç¹·ÃÑ¾Âì(à¢µ5,9),¹Ò§»ÃÐÀÒÈÃÕ ºØ­ÇÔàÈÉ(à¢µ7, 15),¹ÒÂÊØÃÈÑ¡´Ôì àÃÕÂ§à¤Ã×Í(à¢µ8, 16),¹ÒÂÍÔÊÃÐ ÈÔÃÔÇÃÀÒ(à¢µ10, 13),¹Ò§ÍÑ¨¨ÔÁÒ ¨Ñ¹·ÃìÊØÇÒ¹ÔªÂì(à¢µ11, 14),¹Ò§ÀÑ·ÃÀÃ °ÔµÔÂÒÀÃ³ì(à¢µ12, 17)", "ÁÍºËÁÒÂ¼ÙéµÃÇ¨ÃÒª¡ÒÃÊÓ¹Ñ¡¹ÒÂ¡ÃÑ°Á¹µÃÕÃÑº¼Ô´ªÍºà¢µµÃÇ¨ÃÒª¡ÒÃ", " ¤ÓÊÑè§ ¹Ã.·Õè 3 / 2560 Å§ÇÑ¹·Õè 5 Á¡ÃÒ¤Á 2560" });

            migrationBuilder.UpdateData(
                table: "Ministries",
                keyColumn: "Id",
                keyValue: 2L,
                column: "Name",
                value: "กระทรวงกลาโหม");

            migrationBuilder.CreateIndex(
                name: "IX_CentralPolicyUsers_CentralPolicyId",
                table: "CentralPolicyUsers",
                column: "CentralPolicyId");

          
        }
    }
}
